Repository: kraj/glibc
Catalog: po/*.po
Languages: ar

source: %.*s: ARGP_HELP_FMT parameter requires a value
ar: %.*s: معامل ARGP_HELP_FMT يتطلب قيمة

source: %.*s: Unknown ARGP_HELP_FMT parameter
ar: %.*s: معامل ARGP_HELP_FMT غير معروف

source: Garbage in ARGP_HELP_FMT: %s
ar: بيانات تالفة في ARGP_HELP_FMT: %s

source: Mandatory or optional arguments to long options are also mandatory or optional for any corresponding short options.
ar: الوسائط الإلزامية أو الاختيارية للخيارات الطويلة هي أيضاً إلزامية أو اختيارية لأي خيارات قصيرة مقابلة لها.

source: Usage:
ar: الاستخدام:

source: or:
ar: أو:

source: [OPTION...]
ar: [خيار...]

source: Try `%s --help' or `%s --usage' for more information.
ar: جرب `%s --help' أو `%s --usage' لمزيد من المعلومات.

source: Report bugs to %s.
ar: أبلغ عن العلل إلى %s.

source: Give this help list
ar: أعطِ قائمة المساعدة هذه

source: Give a short usage message
ar: أعطِ رسالة استخدام قصيرة

source: NAME
ar: الاسم

source: Set the program name
ar: اضبط اسم البرنامج

source: SECS
ar: ثواني

source: Hang for SECS seconds (default 3600)
ar: تعليق لثوانٍ قدرها (مبدئي 3600)

source: Print program version
ar: اطبع إصدار البرنامج

source: (PROGRAM ERROR) No version known!?
ar: (خطأ في البرنامج) لا يوجد إصدار معروف!؟

source: %s: Too many arguments
ar: %s: وسائط كثيرة جداً

source: (PROGRAM ERROR) Option should have been recognized!?
ar: (خطأ في البرنامج) كان ينبغي التعرف على الخيار!؟

source: %s%s%s:%s: %s%sUnexpected error: %s.
ar: %s%s%s:%s: %s%sخطأ غير متوقع: %s.

source: %s%s%s:%s: %s%sAssertion `%s' failed.
ar: %s%s%s:%s: %s%sفشل التوكيد `%s'.

source: Create C header file NAME containing symbol definitions
ar: أنشئ ملف ترويسة C بالاسم NAME يحتوي على تعريفات الرموز

source: Do not use existing catalog, force new output file
ar: لا تستخدم الفهرس الحالي، وافرض ملف إخراج جديد

source: Write output to file NAME
ar: اكتب المخرجات إلى ملف بالاسم NAME

source: Generate message catalog.vIf INPUT-FILE is -, input is read from standard input. If OUTPUT-FILE is -, output is written to standard output.
ar: توليد فهرس الرسائل.vإذا كان INPUT-FILE هو -، تقرأ المدخلات من الدخل القياسي. إذا كان OUTPUT-FILE هو -، تكتب المخرجات إلى الخرج القياسي.

source: For bug reporting instructions, please see: %s.
ar: لإرشادات الإبلاغ عن العلل، يرجى مراجعة: %s.

source: Copyright (C) %s Free Software Foundation, Inc. This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
ar: حقوق النشر (ج) %s مؤسسة البرمجيات الحرة، المحدودة. هذا برنامج حر؛ انظر المصدر لشروط النسخ. لا يوجد أي ضمان؛ ولا حتى لغرض التسويق أو الملاءمة لغرض معين.

source: Written by %s.
ar: كتبه %s.

source: *standard input*
ar: *الدخل القياسي*

source: cannot open input file `%s'
ar: يتعذر فتح ملف المدخلات `%s'

source: illegal set number
ar: رقم مجموعة غير قانوني

source: duplicate set definition
ar: تعريف مجموعة مكرر

source: this is the first definition
ar: هذا هو التعريف الأول

source: unknown set `%s'
ar: مجموعة غير معروفة `%s'

source: invalid quote character
ar: محرف اقتباس غير صالح

source: unknown directive `%s': line ignored
ar: توجيه غير معروف `%s': تم تجاهل السطر

source: duplicated message number
ar: رقم رسالة مكرر

source: duplicated message identifier
ar: معرّف رسالة مكرر

source: invalid character: message ignored
ar: محرف غير صالح: تم تجاهل الرسالة

source: invalid line
ar: سطر غير صالح

source: malformed line ignored
ar: تجاهل سطر مشوه

source: cannot allocate memory
ar: يتعذر تخصيص الذاكرة

source: cannot open output file `%s'
ar: يتعذر فتح ملف المخرجات `%s'

source: invalid escape sequence
ar: تسلسل هروب غير صالح

source: unterminated message
ar: رسالة غير منتهية

source: while opening old catalog file
ar: أثناء فتح ملف فهرس قديم

source: conversion modules not available
ar: وحدات التحويل غير متوفرة

source: cannot determine escape character
ar: يتعذر تحديد محرف الهروب

source: Don't buffer output
ar: لا تخزن المخرجات مؤقتاً

source: Dump information generated by PC profiling.
ar: تفريغ المعلومات المولدة بواسطة تشكيلة الحاسوب الشخصي.

source: [FILE]
ar: [ملف]

source: cannot read header
ar: يتعذر قراءة الترويسة

source: cannot read pointer pair
ar: يتعذر قراءة زوج المؤشر

source: unexpected end of file in header
ar: نهاية ملف غير متوقعة في الترويسة

source: unexpected end of file in pointer pair
ar: نهاية ملف غير متوقعة في زوج المؤشر

source: cannot open input file
ar: يتعذر فتح ملف المدخلات

source: invalid pointer size
ar: حجم مؤشر غير صالح

source: Usage: xtrace [OPTION]... PROGRAM [PROGRAMOPTION]...\n
ar: الاستخدام: xtrace [خيار]... البرنامج [خيارات-البرنامج]...\n

source: Try \`%s --help' or \`%s --usage' for more information.\n
ar: جرب \`%s --help' أو \`%s --usage' لمزيد من المعلومات.\n

source: %s: option '%s' requires an argument.\n
ar: %s: الخيار '%s' يتطلب وسيطاً.\n

source: Trace execution of program by printing currently executed function. --data=FILE Don't run the program, just print the data from FILE. -?,--help Print this help and exit --usage Give a short usage message -V,--version Print version information and exit Mandatory arguments to long options are also mandatory for any corresponding short options.
ar: تتبع تنفيذ البرنامج عن طريق طباعة الوظيفة المنفذة حالياً. --data=FILE لا تشغل البرنامج، فقط اطبع البيانات من FILE. -?,--help اطبع هذه المساعدة واخرج --usage أعطِ رسالة استخدام قصيرة -V,--version اطبع معلومات الإصدار واخرج الوسائط الإلزامية للخيارات الطويلة هي أيضاً إلزامية لأي خيارات قصيرة مقابلة.

source: For bug reporting instructions, please see:\\n%s.\\n
ar: لإرشادات الإبلاغ عن العلل، يرجى مراجعة:\\n%s.\\n

source: xtrace: unrecognized option \`$1'\n
ar: xtrace: خيار غير معروف \`$1'\n

source: No program name given\n
ar: لم يتم إعطاء اسم برنامج\n

source: executable \`$program' not found\n
ar: الملف التنفيذي \`$program' غير موجود\n

source: \`$program' is no executable\n
ar: \`$program' ليس ملفاً تنفيذياً\n

source: unsupported dlinfo request
ar: طلب dlinfo غير مدعوم

source: invalid namespace
ar: نطاق تسمية غير صالح

source: invalid mode
ar: نمط غير صالح

source: invalid mode parameter
ar: معامل نمط غير صالح

source: unknown or unsupported flag
ar: علم غير معروف أو غير مدعوم

source: Cache file has wrong endianness.
ar: ملف الخبيئة يحتوي على ترتيب بايتات (endianness) خاطئ.

source: Cache generated by:
ar: خبيئة ولدت بواسطة:

source: Can't open cache file %s
ar: يتعذر فتح ملف الخبيئة %s

source: mmap of cache file failed.
ar: فشل mmap لملف الخبيئة.

source: File is not a cache file.
ar: الملف ليس ملف خبيئة.

source: %d libs found in cache `%s'
ar: عثر على %d من المكتبات في الخبيئة `%s'

source: Malformed extension data in cache file %s
ar: بيانات ملحق مشوهة في ملف الخبيئة %s

source: Writing of cache extension data failed
ar: فشلت كتابة بيانات ملحق الخبيئة

source: %s: ISA level is too high (%d > %d)
ar: %s: مستوى ISA مرتفع جداً (%d > %d)

source: Can't create temporary cache file %s
ar: يتعذر إنشاء ملف خبيئة مؤقت %s

source: Writing of cache data failed
ar: فشلت كتابة بيانات الخبيئة

source: Changing access rights of %s to %#o failed
ar: فشل تغيير حقوق الوصول لـ %s إلى %#o

source: Renaming of %s to %s failed
ar: فشل تغيير اسم %s إلى %s

source: Could not create library path
ar: يتعذر إنشاء مسار المكتبة

source: error while loading shared libraries
ar: خطأ أثناء تحميل المكتبات المشتركة

source: DYNAMIC LINKER BUG!!!
ar: علة في الرابط الديناميكي!!!

source: cannot create scope list
ar: يتعذر إنشاء قائمة النطاق

source: shared object not open
ar: الكائن المشترك غير مفتوح

source: DST not allowed in SUID/SGID programs
ar: DST غير مسموح به في برامج SUID/SGID

source: empty dynamic string token substitution
ar: استبدال فارغ لرمز السلسلة الديناميكية

source: cannot load auxiliary `%s' because of empty dynamic string token substitution
ar: يتعذر تحميل المساعد `%s' بسبب استبدال فارغ لرمز السلسلة الديناميكية

source: cannot allocate dependency buffer
ar: يتعذر تخصيص مخزن التبعية المؤقت

source: cannot allocate dependency list
ar: يتعذر تخصيص قائمة التبعيات

source: cannot allocate symbol search list
ar: يتعذر تخصيص قائمة البحث عن الرموز

source: cannot create HWCAP priorities
ar: يتعذر إنشاء أولويات HWCAP

source: cannot create capability list
ar: يتعذر إنشاء قائمة القدرات

source: cannot allocate name record
ar: يتعذر تخصيص سجل الاسم

source: cannot create cache for search path
ar: يتعذر إنشاء خبيئة لمسار البحث

source: cannot create RUNPATH/RPATH copy
ar: يتعذر إنشاء نسخة RUNPATH/RPATH

source: cannot create search path array
ar: يتعذر إنشاء مصفوفة مسار البحث

source: cannot stat shared object
ar: يتعذر جلب معلومات (stat) الكائن المشترك

source: cannot create shared object descriptor
ar: يتعذر إنشاء واصف الكائن المشترك

source: cannot read file data
ar: يتعذر قراءة بيانات الملف

source: ELF load command address/offset not page-aligned
ar: عنوان/إزاحة أمر تحميل ELF غير متحاذٍ مع الصفحة

source: object file has no loadable segments
ar: ملف الكائن لا يحتوي على مقاطع قابلة للتحميل

source: cannot dynamically load executable
ar: يتعذر تحميل الملف التنفيذي ديناميكياً

source: object file has no dynamic section
ar: ملف الكائن لا يحتوي على قسم ديناميكي

source: cannot dynamically load position-independent executable
ar: يتعذر تحميل ملف تنفيذي مستقل عن الموقع ديناميكياً

source: shared object cannot be dlopen()ed
ar: لا يمكن عمل dlopen() للكائن المشترك

source: cannot allocate memory for program header
ar: يتعذر تخصيص ذاكرة لترویسة البرنامج

source: cannot enable executable stack as shared object requires
ar: يتعذر تمكين مكدس قابل للتنفيذ كما يتطلب الكائن المشترك

source: cannot close file descriptor
ar: يتعذر إغلاق واصف الملف

source: file too short
ar: الملف قصير جداً

source: invalid ELF header
ar: ترويسة ELF غير صالحة

source: ELF file data encoding not big-endian
ar: ترميز بيانات ملف ELF ليس big-endian

source: ELF file data encoding not little-endian
ar: ترميز بيانات ملف ELF ليس little-endian

source: ELF file version ident does not match current one
ar: معرف إصدار ملف ELF لا يطابق الحالي

source: ELF file OS ABI invalid
ar: واجهة OS ABI لملف ELF غير صالحة

source: ELF file ABI version invalid
ar: إصدار ABI لملف ELF غير صالح

source: nonzero padding in e_ident
ar: حشو غير صفري في e_ident

source: internal error
ar: خطأ داخلي

source: ELF file version does not match current one
ar: إصدار ملف ELF لا يطابق الحالي

source: only ET_DYN and ET_EXEC can be loaded
ar: يمكن تحميل ET_DYN و ET_EXEC فقط

source: ELF file's phentsize not the expected size
ar: phentsize الخاص بملف ELF ليس بالحجم المتوقع

source: wrong ELF class: ELFCLASS64
ar: فئة ELF خاطئة: ELFCLASS64

source: wrong ELF class: ELFCLASS32
ar: فئة ELF خاطئة: ELFCLASS32

source: cannot open shared object file
ar: يتعذر فتح ملف الكائن المشترك

source: failed to map segment from shared object
ar: فشل في تخطيط (map) مقطع من الكائن المشترك

source: cannot change memory protections
ar: يتعذر تغيير حماية الذاكرة

source: cannot map zero-fill pages
ar: يتعذر تخطيط صفحات مملوءة بالأصفار

source: symbol lookup error
ar: خطأ في البحث عن الرمز

source: cannot extend global scope
ar: يتعذر تمديد النطاق العام

source: TLS generation counter wrapped! Please report this.
ar: عداد توليد TLS التف! يرجى الإبلاغ عن هذا.

source: cannot allocate address lookup data
ar: يتعذر تخصيص بيانات البحث عن العنوان

source: invalid mode for dlopen()
ar: نمط غير صالح لـ dlopen()

source: no more namespaces available for dlmopen()
ar: لا تتوفر نطاقات تسمية إضافية لـ dlmopen()

source: invalid target namespace in dlmopen()
ar: نطاق تسمية مستهدف غير صالح في dlmopen()

source: cannot allocate memory in static TLS block
ar: يتعذر تخصيص ذاكرة في كتلة TLS الساكنة

source: cannot make segment writable for relocation
ar: يتعذر جعل المقطع قابلاً للكتابة لإعادة التوطين

source: %s: out of memory to store relocation results for %s
ar: %s: نفدت الذاكرة لتخزين نتائج إعادة التوطين لـ %s

source: cannot restore segment prot after reloc
ar: يتعذر استعادة حماية المقطع بعد إعادة التوطين

source: cannot apply additional memory protection after relocation
ar: يتعذر تطبيق حماية إضافية للذاكرة بعد إعادة التوطين

source: RTLD_NEXT used in code not dynamically loaded
ar: استخدم RTLD_NEXT في كود لم يتم تحميله ديناميكياً

source: cannot create TLS data structures
ar: يتعذر إنشاء هياكل بيانات TLS

source: version lookup error
ar: خطأ في البحث عن الإصدار

source: cannot allocate version reference table
ar: يتعذر تخصيص جدول مرجعي للإصدار

source: DT_RELR without GLIBC_ABI_DT_RELR dependency
ar: DT_RELR بدون تبعية GLIBC_ABI_DT_RELR

source: Print cache
ar: اطبع الخبيئة

source: Generate verbose messages
ar: توليد رسائل مفصلة

source: Don't build cache
ar: لا تبنِ الخبيئة

source: Don't update symbolic links
ar: لا تحدث الروابط الرمزية

source: Change to and use ROOT as root directory
ar: تغيير واستخدام ROOT كدليل جذري

source: CACHE
ar: الخبيئة

source: Use CACHE as cache file
ar: استخدم CACHE كملف خبيئة

source: Use CONF as configuration file
ar: استخدم CONF كملف ضبط

source: Only process directories specified on the command line. Don't build cache.
ar: معالجة الأدلة المحددة فقط في سطر الأوامر. لا تبنِ الخبيئة.

source: Manually link individual libraries.
ar: اربط المكتبات الفردية يدوياً.

source: FORMAT
ar: التنسيق

source: Format to use: new (default), old, or compat
ar: التنسيق المستخدم: جديد (مبدئي)، قديم، أو متوافق

source: Ignore auxiliary cache file
ar: تجاهل ملف الخبيئة المساعد

source: Configure Dynamic Linker Run Time Bindings.
ar: اضبط روابط وقت التشغيل للرابط الديناميكي.

source: Path `%s' given more than once
ar: تم إعطاء المسار `%s' أكثر من مرة

source: (from %s:%d and %s:%d)
ar: (من %s:%d و %s:%d)

source: Could not form glibc-hwcaps path
ar: يتعذر تشكيل مسار glibc-hwcaps

source: Listing directory %s
ar: إدراج محتويات الدليل %s

source: Can't stat %s
ar: يتعذر جلب معلومات %s

source: Can't stat %s
ar: يتعذر جلب معلومات %s

source: %s is not a symbolic link
ar: %s ليس رابطاً رمزياً

source: Can't unlink %s
ar: يتعذر فك ربط %s

source: Can't link %s to %s
ar: يتعذر ربط %s بـ %s

source: (changed)
ar: (تغير)

source: (SKIPPED)
ar: (تخطى)

source: Can't find %s
ar: يتعذر العثور على %s

source: Cannot lstat %s
ar: يتعذر عمل lstat لـ %s

source: Ignored file %s since it is not a regular file.
ar: تجاهل ملف %s لأنه ليس ملفاً عادياً.

source: No link created since soname could not be found for %s
ar: لم ينشأ أي رابط لأنه تعذر العثور على soname لـ %s

source: (from %s:%d)
ar: (من %s:%d)

source: Can't open directory %s
ar: يتعذر فتح الدليل %s

source: Could not form library path
ar: يتعذر تشكيل مسار المكتبة

source: Input file %s not found.
ar: ملف المدخلات %s غير موجود.

source: Cannot stat %s
ar: يتعذر عمل stat لـ %s

source: libc6 library %s in wrong directory
ar: مكتبة libc6 %s في دليل خاطئ

source: libraries %s and %s in directory %s have same soname but different type.
ar: المكتبتان %s و %s في الدليل %s لهما نفس soname ولكن بنوع مختلف.

source: Warning: ignoring configuration file that cannot be opened: %s
ar: تحذير: تجاهل ملف الضبط الذي لا يمكن فتحه: %s

source: %s:%u: hwcap directive ignored
ar: %s:%u: تم تجاهل توجيه hwcap

source: need absolute file name for configuration file when using -r
ar: بحاجة لاسم ملف مطلق لملف الضبط عند استخدام -r

source: memory exhausted
ar: نفدت الذاكرة

source: %s:%u: cannot read directory %s
ar: %s:%u: يتعذر قراءة الدليل %s

source: relative path `%s' used to build cache
ar: استخدم المسار النسبي `%s' لبناء الخبيئة

source: Can't chdir to /
ar: يتعذر تغيير الدليل إلى /

source: Can't open cache file directory %s
ar: يتعذر فتح دليل ملف الخبيئة %s

source: Written by %s and %s.
ar: كتبه %s و %s.

source: Usage: ldd [OPTION]... FILE... --help print this help and exit --version print version information and exit -d, --data-relocs process data relocations -r, --function-relocs process data and function relocations -u, --unused print unused direct dependencies -v, --verbose print all information
ar: الاستخدام: ldd [خيار]... ملف... --help اطبع هذه المساعدة واخرج --version اطبع معلومات الإصدار واخرج -d, --data-relocs معالجة إعادة توطين البيانات -r, --function-relocs معالجة إعادة توطين البيانات والوظائف -u, --unused اطبع التبعيات المباشرة غير المستخدمة -v, --verbose اطبع كافة المعلومات

source: ldd: option \`$1' is ambiguous
ar: ldd: الخيار \`$1' غامض

source: unrecognized option
ar: خيار غير معروف

source: Try \`ldd --help' for more information.
ar: جرب \`ldd --help' لمزيد من المعلومات.

source: missing file arguments
ar: وسائط الملف مفقودة

source: No such file or directory
ar: لا يوجد ملف أو دليل بهذا الاسم

source: not regular file
ar: ليس ملفاً عادياً

source: warning: you do not have execution permission for
ar: تحذير: ليس لديك إذن تنفيذ لـ

source: not a dynamic executable
ar: ليس ملفاً تنفيذياً ديناميكياً

source: exited with unknown exit code
ar: خرج بكود خروج غير معروف

source: error: you do not have read permission for
ar: خطأ: ليس لديك إذن قراءة لـ

source: cannot find program header of process
ar: يتعذر العثور على ترويسة البرنامج للعملية

source: cannot read program header
ar: يتعذر قراءة ترويسة البرنامج

source: cannot read dynamic section
ar: يتعذر قراءة القسم الديناميكي

source: cannot read r_debug
ar: يتعذر قراءة r_debug

source: cannot read program interpreter
ar: يتعذر قراءة مترجم البرنامج

source: cannot read link map
ar: يتعذر قراءة خريطة الربط

source: cannot read object name
ar: يتعذر قراءة اسم الكائن

source: cannot allocate buffer for object name
ar: يتعذر تخصيص مخزن مؤقت لاسم الكائن

source: List dynamic shared objects loaded into process.
ar: إدراج الكائنات المشتركة الديناميكية المحملة في العملية.

source: PID
ar: معرّف العملية

source: Exactly one parameter with process ID required.
ar: مطلوب معامل واحد بالضبط مع معرف العملية.

source: invalid process ID '%s'
ar: معرف عملية غير صالح '%s'

source: cannot open %s
ar: يتعذر فتح %s

source: cannot open %s/task
ar: يتعذر فتح %s/task

source: cannot prepare reading %s/task
ar: يتعذر التحضير لقراءة %s/task

source: invalid thread ID '%s'
ar: معرف خيط غير صالح '%s'

source: cannot attach to process %lu
ar: يتعذر الاتصال بالعملية %lu

source: no valid %s/task entries
ar: لا توجد مدخلات %s/task صالحة

source: cannot get information about process %lu
ar: يتعذر جلب معلومات عن العملية %lu

source: process %lu is no ELF program
ar: العملية %lu ليست برنامج ELF

source: file %s is truncated
ar: الملف %s مبتور

source: %s is a 32 bit ELF file.
ar: %s هو ملف ELF ذو 32 بت.

source: %s is a 64 bit ELF file.
ar: %s هو ملف ELF ذو 64 بت.

source: Unknown ELFCLASS in file %s.
ar: ELFCLASS غير معروف في الملف %s.

source: %s is not a shared object file (Type: %d).
ar: %s ليس ملف كائن مشترك (النوع: %d).

source: more than one dynamic segment
ar: أكثر من مقطع ديناميكي واحد

source: Cannot fstat file %s.
ar: يتعذر عمل fstat للملف %s.

source: File %s is empty, not checked.
ar: الملف %s فارغ، لم يفحص.

source: File %s is too small, not checked.
ar: الملف %s صغير جداً، لم يفحص.

source: Cannot mmap file %s.
ar: يتعذر عمل mmap للملف %s.

source: %s is not an ELF file - it has the wrong magic bytes at the start.
ar: %s ليس ملف ELF - يحتوي على بايتات سحرية خاطئة في البداية.

source: Usage: sln src dest|file
ar: الاستخدام: sln src dest|file

source: %s: file open error: %m
ar: %s: خطأ في فتح الملف: %m

source: No target in line %d
ar: لا يوجد هدف في السطر %d

source: %s: destination must not be a directory
ar: %s: الوجهة يجب ألا تكون دليلاً

source: %s: failed to remove the old destination
ar: %s: فشل في إزالة الوجهة القديمة

source: %s: invalid destination: %s
ar: %s: وجهة غير صالحة: %s

source: Invalid link from "%s" to "%s": %s
ar: رابط غير صالح من "%s" إلى "%s": %s

source: Usage: sotruss [OPTION...] [--] EXECUTABLE [EXECUTABLE-OPTION...] -F, --from FROMLIST Trace calls from objects on FROMLIST -T, --to TOLIST Trace calls to objects on TOLIST -e, --exit Also show exits from the function calls -f, --follow Trace child processes -o, --output FILENAME Write output to FILENAME (or FILENAME.$PID in case -f is also used) instead of standard error -?, --help Give this help list --usage Give a short usage message --version Print program version
ar: الاستخدام: sotruss [خيار...] [--] EXECUTABLE [خيارات-التنفيذي...] -F, --from FROMLIST تتبع الاستدعاءات من كائنات في FROMLIST -T, --to TOLIST تتبع الاستدعاءات إلى كائنات في TOLIST -e, --exit أظهر أيضاً عمليات الخروج من استدعاءات الوظائف -f, --follow تتبع العمليات التابعة -o, --output FILENAME اكتب المخرجات إلى FILENAME (أو FILENAME.$PID في حال استخدام -f أيضاً) بدلاً من الخطأ القياسي -?, --help أعطِ قائمة المساعدة هذه --usage أعطِ رسالة استخدام قصيرة --version اطبع إصدار البرنامج

source: Mandatory arguments to long options are also mandatory for any corresponding\nshort options.\n
ar: الوسائط الإلزامية للخيارات الطويلة هي أيضاً إلزامية لأي خيارات\nقصيرة مقابلة.\n

source: %s: option requires an argument -- '%s'\n
ar: %s: الخيار يتطلب وسيطاً -- '%s'\n

source: %s: option is ambiguous; possibilities:
ar: %s: الخيار غامض؛ الاحتمالات:

source: Written by %s.\n
ar: كتبه %s.\n

source: Usage: %s [-ef] [-F FROMLIST] [-o FILENAME] [-T TOLIST] [--exit] [--follow] [--from FROMLIST] [--output FILENAME] [--to TOLIST] [--help] [--usage] [--version] [--] EXECUTABLE [EXECUTABLE-OPTION...]\n
ar: الاستخدام: %s [-ef] [-F FROMLIST] [-o FILENAME] [-T TOLIST] [--exit] [--follow] [--from FROMLIST] [--output FILENAME] [--to TOLIST] [--help] [--usage] [--version] [--] الملف التنفيذي [خيارات-الملف-التنفيذي...]\n

source: %s: unrecognized option '%c%s'\n
ar: %s: خيار غير معروف '%c%s'\n

source: Output selection:
ar: تحديد المخرجات:

source: print list of count paths and their number of use
ar: اطبع قائمة بمسارات العد وعدد استخداماتها

source: generate flat profile with counts and ticks
ar: توليد تشكيلة مسطحة مع الأعداد والتكات

source: generate call graph
ar: توليد رسم بياني للاستدعاءات

source: Read and display shared object profiling data.
ar: قراءة وعرض بيانات تشكيلة الكائن المشترك.

source: failed to load shared object `%s'
ar: فشل تحميل الكائن المشترك `%s'

source: cannot create internal descriptor
ar: يتعذر إنشاء واصف داخلي

source: Reopening shared object `%s' failed
ar: فشل إعادة فتح الكائن المشترك `%s'

source: stat(%s) failure
ar: فشل stat(%s)

source: read outside of file extents %zu + %jd > %jd
ar: قراءة خارج نطاقات الملف %zu + %jd > %jd

source: reading of section headers failed
ar: فشلت قراءة ترويسات الأقسام

source: reading of section header string table failed
ar: فشلت قراءة جدول سلاسل ترويسات الأقسام

source: *** Cannot read debuginfo file name: %m
ar: *** يتعذر قراءة اسم ملف معلومات التنقيح: %m

source: cannot determine file name
ar: يتعذر تحديد اسم الملف

source: reading of ELF header failed
ar: فشلت قراءة ترويسة ELF

source: too many section headers
ar: ترويسات أقسام كثيرة جداً

source: *** The file `%s' is stripped: no detailed analysis possible
ar: *** الملف `%s' مجرد: لا يمكن إجراء تحليل مفصل

source: failed to load symbol data
ar: فشل تحميل بيانات الرموز

source: cannot load profiling data
ar: يتعذر تحميل بيانات التشكيلة

source: while stat'ing profiling data file
ar: أثناء جلب معلومات ملف بيانات التشكيلة

source: profiling data file `%s' does not match shared object `%s'
ar: ملف بيانات التشكيلة `%s' لا يطابق الكائن المشترك `%s'

source: failed to mmap the profiling data file
ar: فشل mmap لملف بيانات التشكيلة

source: error while closing the profiling data file
ar: خطأ أثناء إغلاق ملف بيانات التشكيلة

source: `%s' is no correct profile data file for `%s'
ar: `%s' ليس ملف بيانات تشكيلة صحيح لـ `%s'

source: cannot allocate symbol data
ar: يتعذر تخصيص بيانات الرموز

source: String table string is too long
ar: سلسلة جدول السلاسل طويلة جداً

source: String table has too many entries
ar: جدول السلاسل يحتوي على مدخلات كثيرة جداً

source: String table is too large
ar: جدول السلاسل كبير جداً

source: cannot open output file
ar: يتعذر فتح ملف المخرجات

source: error while closing input `%s'
ar: خطأ أثناء إغلاق المدخلات `%s'

source: illegal input sequence at position %zd
ar: تسلسل مدخلات غير قانوني في الموقع %zd

source: incomplete character or shift sequence at end of buffer
ar: محرف أو تسلسل إزاحة غير مكتمل في نهاية المخزن المؤقت
