Repository: kraj/glibc
Catalog: po/*.po
Languages: ar

source: Information request
ar: طلب معلومات

source: Resource lost
ar: فُقد المورد

source: Operation not permitted
ar: العملية غير مسموح بها

source: No such process
ar: لا توجد عملية كهذه

source: Interrupted system call
ar: نداء نظام مقطوع

source: Input/output error
ar: خطأ إدخال/إخراج

source: No such device or address
ar: لا يوجد جهاز أو عنوان كهذا

source: Argument list too long
ar: قائمة المعاملات طويلة جداً

source: Exec format error
ar: خطأ في تنسيق التنفيذ

source: Bad file descriptor
ar: واصف ملف سيئ

source: No child processes
ar: لا توجد عمليات أبناء

source: Resource deadlock avoided
ar: تُجنب مأزق (deadlock) المورد

source: Cannot allocate memory
ar: يتعذر تخصيص ذاكرة

source: Bad address
ar: عنوان سيئ

source: Block device required
ar: مطلوب جهاز كتلوي

source: Device or resource busy
ar: الجهاز أو المورد مشغول

source: File exists
ar: الملف موجود

source: Invalid cross-device link
ar: رابط عبر الأجهزة غير صالح

source: No such device
ar: لا يوجد جهاز كهذا

source: Not a directory
ar: ليس دليلاً

source: Is a directory
ar: إنه دليل

source: Invalid argument
ar: معامل غير صالح

source: Too many open files
ar: ملفات مفتوحة كثيرة جداً

source: Too many open files in system
ar: ملفات مفتوحة كثيرة جداً في النظام

source: Inappropriate ioctl for device
ar: ioctl غير مناسب للجهاز

source: Text file busy
ar: ملف نصي مشغول

source: File too large
ar: الملف كبير جداً

source: No space left on device
ar: لم تتبقَ مساحة على الجهاز

source: Illegal seek
ar: عملية بحث (seek) غير قانونية

source: Read-only file system
ar: نظام ملفات للقراءة فقط

source: Too many links
ar: روابط كثيرة جداً

source: Numerical argument out of domain
ar: المعامل الرقمي خارج النطاق

source: Numerical result out of range
ar: النتيجة الرقمية خارج النطاق

source: Resource temporarily unavailable
ar: المورد غير متاح مؤقتاً

source: Operation now in progress
ar: العملية جارية الآن

source: Operation already in progress
ar: العملية جارية بالفعل

source: Socket operation on non-socket
ar: عملية مقبس على غير مقبس

source: Message too long
ar: الرسالة طويلة جداً

source: Protocol wrong type for socket
ar: نوع بروتوكول خاطئ للمقبس

source: Protocol not available
ar: البروتوكول غير متاح

source: Protocol not supported
ar: البروتوكول غير مدعوم

source: Socket type not supported
ar: نوع المقبس غير مدعوم

source: Operation not supported
ar: العملية غير مدعومة

source: Protocol family not supported
ar: عائلة البروتوكولات غير مدعومة

source: Address family not supported by protocol
ar: عائلة العناوين غير مدعومة من البروتوكول

source: Address already in use
ar: العنوان مستخدم بالفعل

source: Cannot assign requested address
ar: يتعذر تعيين العنوان المطلوب

source: Network is down
ar: الشبكة متوقفة

source: Network is unreachable
ar: لا يمكن الوصول للشبكة

source: Network dropped connection on reset
ar: أسقطت الشبكة الاتصال عند إعادة الضبط

source: Software caused connection abort
ar: تسبب برنامج في إجهاض الاتصال

source: Connection reset by peer
ar: أعاد الند ضبط الاتصال

source: No buffer space available
ar: لا تتوفر مساحة في المخزن المؤقت

source: Transport endpoint is already connected
ar: نقطة نهاية النقل متصلة بالفعل

source: Transport endpoint is not connected
ar: نقطة نهاية النقل غير متصلة

source: Destination address required
ar: عنوان الوجهة مطلوب

source: Cannot send after transport endpoint shutdown
ar: لا يمكن الإرسال بعد إغلاق نقطة نهاية النقل

source: Too many references: cannot splice
ar: مراجع كثيرة جداً: لا يمكن الوصل

source: Connection timed out
ar: انتهت مهلة الاتصال

source: Connection refused
ar: رُفض الاتصال

source: Too many levels of symbolic links
ar: مستويات كثيرة جداً من الروابط الرمزية

source: File name too long
ar: اسم الملف طويل جداً

source: Host is down
ar: المضيف متوقف

source: No route to host
ar: لا يوجد مسار للمضيف

source: Directory not empty
ar: الدليل ليس فارغاً

source: Too many users
ar: مستخدمون كثيرون جداً

source: Disk quota exceeded
ar: تجاوزت حصة القرص

source: Stale file handle
ar: مقبض ملف قديم

source: Object is remote
ar: الكائن بعيد

source: No locks available
ar: لا توجد أقفال متاحة

source: Function not implemented
ar: الدالة غير مدعومة

source: Invalid or incomplete multibyte or wide character
ar: محرف متعدد البايتات أو عريض غير صالح أو غير مكتمل

source: Bad message
ar: رسالة سيئة

source: Identifier removed
ar: أزيل المعرف

source: Multihop attempted
ar: محاولة قفزات متعددة

source: No data available
ar: لا تتوفر بيانات

source: Link has been severed
ar: انقطع الرابط

source: No message of desired type
ar: لا توجد رسالة من النوع المطلوب

source: Out of streams resources
ar: نفاد موارد الدفق

source: Device not a stream
ar: الجهاز ليس دفقاً

source: Value too large for defined data type
ar: القيمة كبيرة جداً لنوع البيانات المحدد

source: Protocol error
ar: خطأ في البروتوكول

source: Timer expired
ar: انتهى المؤقت

source: Operation canceled
ar: أُلغيت العملية

source: Owner died
ar: توفي المالك

source: State not recoverable
ar: حالة لا يمكن استردادها

source: Interrupted system call should be restarted
ar: يجب إعادة تشغيل نداء النظام المقاطع

source: Channel number out of range
ar: رقم القناة خارج النطاق

source: Level 2 not synchronized
ar: المستوى 2 غير متزامن

source: Level 3 halted
ar: توقف المستوى 3

source: Level 3 reset
ar: إعادة ضبط المستوى 3

source: Link number out of range
ar: رقم الرابط خارج النطاق

source: Protocol driver not attached
ar: برنامج تشغيل البروتوكول غير متصل

source: No CSI structure available
ar: لا يتوفر هيكل CSI

source: Level 2 halted
ar: توقف المستوى 2

source: Invalid exchange
ar: تبادل غير صالح

source: Invalid request descriptor
ar: واصف طلب غير صالح

source: Exchange full
ar: التبادل ممتلئ

source: No anode
ar: لا توجد مصعدة (anode)

source: Invalid request code
ar: رمز طلب غير صالح

source: Invalid slot
ar: فتحة غير صالحة

source: File locking deadlock error
ar: خطأ مأزق قفل الملف

source: Bad font file format
ar: تنسيق ملف خط سيء

source: Machine is not on the network
ar: الجهاز ليس على الشبكة

source: Package not installed
ar: الحزمة غير مثبتة

source: Advertise error
ar: خطأ إعلان

source: Srmount error
ar: خطأ Srmount

source: Communication error on send
ar: خطأ اتصال عند الإرسال

source: RFS specific error
ar: خطأ خاص بـ RFS

source: Name not unique on network
ar: الاسم ليس فريداً على الشبكة

source: File descriptor in bad state
ar: واصف الملف في حالة سيئة

source: Remote address changed
ar: تغير العنوان البعيد

source: Can not access a needed shared library
ar: لا يمكن الوصول إلى مكتبة مشتركة مطلوبة

source: Accessing a corrupted shared library
ar: الوصول إلى مكتبة مشتركة تالفة

source: .lib section in a.out corrupted
ar: مقطع .lib في a.out تالف

source: Attempting to link in too many shared libraries
ar: محاولة ربط عدد كبير جداً من المكتبات المشتركة

source: Cannot exec a shared library directly
ar: لا يمكن تنفيذ مكتبة مشتركة مباشرة

source: Streams pipe error
ar: خطأ في أنبوب الدفق

source: Structure needs cleaning
ar: الهيكل يحتاج إلى تنظيف

source: Not a XENIX named type file
ar: ليس ملف نوع مسمى XENIX

source: No XENIX semaphores available
ar: لا تتوفر إشارات XENIX

source: Is a named type file
ar: هو ملف نوع مسمى

source: Remote I/O error
ar: خطأ إدخال/إخراج بعيد

source: No medium found
ar: لم يتم العثور على وسيط

source: Wrong medium type
ar: نوع وسيط خاطئ

source: Required key not available
ar: المفتاح المطلوب غير متاح

source: Key has expired
ar: انتهت صلاحية المفتاح

source: Key has been revoked
ar: أُلغي المفتاح

source: Key was rejected by service
ar: رفضت الخدمة المفتاح

source: Operation not possible due to RF-kill
ar: العملية غير ممكنة بسبب RF-kill

source: Memory page has hardware error
ar: صفحة الذاكرة بها خطأ عتادي

source: RPC struct is bad
ar: هيكل RPC سيء

source: Inappropriate file type or format
ar: نوع ملف أو تنسيق غير ملائم

source: RPC bad procedure for program
ar: إجراء RPC سيء للبرنامج

source: Authentication error
ar: خطأ في الاستيثاق

source: Translator died
ar: توقف المترجم

source: RPC version wrong
ar: إصدار RPC خاطئ

source: You really blew it this time
ar: لقد أفسدت الأمر حقاً هذه المرة

source: Too many processes
ar: عمليات كثيرة جداً

source: Gratuitous error
ar: خطأ مجاني

source: Not supported
ar: غير مدعوم

source: RPC program version wrong
ar: إصدار برنامج RPC خاطئ

source: Inappropriate operation for background process
ar: عملية غير ملائمة لعملية خلفية

source: Computer bought the farm
ar: ودع الحاسوب الملاعب

source: Operation would block
ar: العملية ستؤدي إلى حظر

source: Need authenticator
ar: بحاجة لموثق

source: RPC program not available
ar: برنامج RPC غير متاح

source: Initialization error
ar: خطأ في التهيئة

source: Device is remote
ar: الجهاز بعيد

source: Too many levels of remote in path
ar: مستويات كثيرة جداً من البعد في المسار

source: cannot map pages for fdesc table
ar: لا يمكن مطابقة الصفحات لجدول fdesc

source: cannot map pages for fptr table
ar: لا يمكن مطابقة الصفحات لجدول fptr

source: internal error: symidx out of range of fptr table
ar: خطأ داخلي: symidx خارج نطاق جدول fptr

source: Error in unknown error system:
ar: خطأ في نظام أخطاء مجهول:

source: Unknown error code:
ar: رمز خطأ مجهول:

source: Address family for hostname not supported
ar: فئة العناوين لاسم المضيف غير مدعومة

source: Temporary failure in name resolution
ar: فشل مؤقت في حل الاسم

source: Bad value for ai_flags
ar: قيمة سيئة لـ ai_flags

source: Non-recoverable failure in name resolution
ar: فشل غير قابل للاسترداد في حل الاسم

source: ai_family not supported
ar: ai_family غير مدعومة

source: Memory allocation failure
ar: فشل في تخصيص الذاكرة

source: No address associated with hostname
ar: لا يوجد عنوان مرتبط باسم المضيف

source: Name or service not known
ar: الاسم أو الخدمة غير معروفة

source: Servname not supported for ai_socktype
ar: اسم الخدمة غير مدعوم لـ ai_socktype

source: ai_socktype not supported
ar: ai_socktype غير مدعوم

source: System error
ar: خطأ في النظام

source: Processing request in progress
ar: معالجة الطلب قيد التنفيذ

source: Request canceled
ar: أُلغي الطلب

source: Request not canceled
ar: لم يُلغَ الطلب

source: All requests done
ar: انتهت جميع الطلبات

source: Interrupted by a signal
ar: قوطع بواسطة إشارة

source: Parameter string not correctly encoded
ar: سلسلة المعاملات لم يتم ترميزها بشكل صحيح

source: Result too large for supplied buffer
ar: النتيجة كبيرة جداً للمخزن المؤقت المقدم

source: CPU ISA level is lower than required
ar: مستوى CPU ISA أقل من المطلوب

source: %s is for unknown machine %d.
ar: %s لآلة مجهولة %d.

source: rebuild shared object with IBT support enabled
ar: أعد بناء الكائن المشترك مع تفعيل دعم IBT

source: rebuild shared object with SHSTK support enabled
ar: أعد بناء الكائن المشترك مع تفعيل دعم SHSTK

source: can't disable IBT
ar: لا يمكن تعطيل IBT

source: can't disable SHSTK
ar: لا يمكن تعطيل SHSTK

source: %s: size overflow
ar: %s: تجاوز السعة

source: %s: Memory exhausted
ar: %s: نفدت الذاكرة

source: %s: unknown timezone '%s': %s
ar: %s: منطقة زمنية مجهولة '%s': %s

source: has characters other than ASCII alphanumerics, '-' or '+'
ar: يحتوي محارف غير الحروف والأرقام و '-' أو '+'

source: has fewer than 3 characters
ar: يحتوي أقل من 3 محارف

source: has more than 6 characters
ar: يحتوي أكثر من 6 محارف

source: %s: warning: zone "%s" abbreviation "%s" %s
ar: %s: تحذير: اختصار المنطقة "%s" هو "%s" %s

source: %s: usage: %s OPTIONS TIMEZONE ... Options include: -c [L,]U Start at year L (default -500), end before year U (default 2500) -t [L,]U Start at time L, end before time U (in seconds since 1970) -i List transitions briefly (format is experimental) -v List transitions verbosely -V List transitions a bit less verbosely --help Output this help --version Output version info Report bugs to %s.
ar: %s: الاستخدام: %s خيارات المنطقة_الزمنية ... الخيارات تشمل: -c [L,]U البدء في السنة L (مبدئي -500)، والانتهاء قبل السنة U (مبدئي 2500) -t [L,]U البدء في الوقت L، والانتهاء قبل الوقت U (بالثواني منذ 1970) -i سرد التحولات باختصار (تنسيق تجريبي) -v سرد التحولات بإسهاب -V سرد التحولات بإسهاب أقل قليلاً --help إخراج المساعدة --version إخراج معلومات الإصدار أبلغ عن الأخطاء إلى %s.

source: %s: wild -c argument %s
ar: %s: معامل -c جامح %s

source: %s: wild -t argument %s
ar: %s: معامل -t جامح %s

source: (gmtime failed)
ar: (فشل gmtime)

source: (localtime failed)
ar: (فشل localtime)

source: %s: Memory exhausted: %s
ar: %s: نفدت الذاكرة: %s

source: size overflow
ar: تجاوز السعة

source: integer overflow
ar: تجاوز سعة العدد الصحيح

source: command line
ar: سطر الأوامر

source: standard input
ar: الإدخال القياسي

source: "%s", line %<PRIdMAX>:
ar: "%s"، السطر %<PRIdMAX>:

source: (rule from "%s", line %<PRIdMAX>)
ar: (قاعدة من "%s"، السطر %<PRIdMAX>)

source: warning:
ar: تحذير:

source: %s: usage is %s [ --version ] [ --help ] [ -v ] \ [ -b {slim|fat} ] [ -d directory ] [ -l localtime ] [ -L leapseconds ] \ [ -p posixrules ] [ -r '[@lo][/@hi]' ] [ -R '@hi' ] \ [ -t localtime-link ] \ [ filename ... ] Report bugs to %s.
ar: %s: الاستخدام هو %s [ --version ] [ --help ] [ -v ] \ [ -b {slim|fat} ] [ -d الدليل ] [ -l الوقت_المحلي ] [ -L الثواني_الكبيسة ] \ [ -p قواعد_posix ] [ -r '[@lo][/@hi]' ] [ -R '@hi' ] \ [ -t رابط_الوقت_المحلي ] \ [ اسم_الملف ... ] أبلغ عن الأخطاء إلى %s.

source: %s: Can't chdir to %s: %s
ar: %s: لا يمكن تغيير الدليل إلى %s: %s

source: "Link %s %s" is part of a link cycle
ar: "Link %s %s" جزء من دورة روابط

source: link %s targets itself
ar: الرابط %s يستهدف نفسه

source: link %s targeting link %s mishandled by pre-2023 zic
ar: الرابط %s الذي يستهدف الرابط %s تم التعامل معه بشكل خاطئ بواسطة zic ما قبل 2023

source: link %s targeting link %s
ar: الرابط %s يستهدف الرابط %s

source: wild compilation-time specification of zic_t
ar: مواصفة وقت ترجمة جامحة لـ zic_t

source: incompatible -b options
ar: خيارات -b غير متوافقة

source: invalid option: -b '%s'
ar: خيار غير صالح: -b '%s'

source: %s: More than one -d option specified
ar: %s: تم تحديد أكثر من خيار -d

source: %s: More than one -l option specified
ar: %s: تم تحديد أكثر من خيار -l

source: %s: More than one -p option specified
ar: %s: تم تحديد أكثر من خيار -p

source: %s: More than one -t option specified
ar: %s: تم تحديد أكثر من خيار -t

source: -y ignored
ar: تم تجاهل -y

source: %s: More than one -L option specified
ar: %s: تم تحديد أكثر من خيار -L

source: %s: More than one -r option specified
ar: %s: تم تحديد أكثر من خيار -r

source: %s: invalid time range: %s
ar: %s: نطاق زمني غير صالح: %s

source: %s: invalid time: %s
ar: %s: وقت غير صالح: %s

source: -s ignored
ar: تم تجاهل -s

source: %s: -R time exceeds -r cutoff
ar: %s: وقت -R يتجاوز حد -r

source: empty file name
ar: اسم ملف فارغ

source: file name '%s' begins with '/'
ar: اسم الملف '%s' يبدأ بـ '/'

source: file name '%s' contains '%.*s' component
ar: اسم الملف '%s' يحتوي على المكون '%.*s'

source: file name '%s' component contains leading '-'
ar: مكون اسم الملف '%s' يحتوي على '-' في بدايته

source: file name '%s' contains overlength component '%.*s...'
ar: اسم الملف '%s' يحتوي على مكون زائد الطول '%.*s...'

source: file name '%s' contains byte '%c'
ar: اسم الملف '%s' يحتوي على البايت '%c'

source: file name '%s' contains byte '\%o'
ar: اسم الملف '%s' يحتوي على البايت '\%o'

source: %s: Can't create %s/%s: %s
ar: %s: لا يمكن إنشاء %s/%s: %s

source: %s: rename to %s/%s: %s
ar: %s: إعادة التسمية إلى %s/%s: %s

source: %s: Can't remove %s/%s: %s
ar: %s: لا يمكن إزالة %s/%s: %s

source: %s: Can't link %s/%s to %s/%s: %s
ar: %s: لا يمكن ربط %s/%s بـ %s/%s: %s

source: symbolic link used because hard link failed: %s
ar: استخدم رابط رمزي لأن الرابط الصلب فشل: %s

source: %s: Can't read %s/%s: %s
ar: %s: لا يمكن قراءة %s/%s: %s

source: copy used because hard link failed: %s
ar: استخدم النسخ لأن الرابط الصلب فشل: %s

source: copy used because symbolic link failed: %s
ar: استخدم النسخ لأن الرابط الرمزي فشل: %s

source: same rule name in multiple files
ar: نفس اسم القاعدة في ملفات متعددة

source: %s in ruleless zone
ar: %s في منطقة بلا قواعد

source: input error
ar: خطأ إدخال

source: unterminated line
ar: سطر غير منتهٍ

source: NUL input byte
ar: بايت إدخال NUL

source: line too long
ar: السطر طويل جداً

source: %s: Can't open %s: %s
ar: %s: لا يمكن فتح %s: %s

source: input line of unknown type
ar: سطر إدخال من نوع مجهول

source: expected continuation line not found
ar: السطر التكميلي المتوقع غير موجود

source: fractional seconds rejected by pre-2018 versions of zic
ar: الثواني الكسرية مرفوضة من قبل إصدارات zic ما قبل 2018

source: time overflow
ar: تجاوز وقت

source: values over 24 hours not handled by pre-2007 versions of zic
ar: القيم التي تزيد عن 24 ساعة لا تعالجها إصدارات zic ما قبل 2007

source: invalid saved time
ar: وقت محفوظ غير صالح

source: wrong number of fields on Rule line
ar: عدد حقول خاطئ في سطر القاعدة (Rule)

source: Invalid rule name "%s"
ar: اسم قاعدة غير صالح "%s"

source: wrong number of fields on Zone line
ar: عدد حقول خاطئ في سطر المنطقة (Zone)

source: "Zone %s" line and -l option are mutually exclusive
ar: سطر "Zone %s" والخيار -l متعارضان

source: "Zone %s" line and -p option are mutually exclusive
ar: سطر "Zone %s" والخيار -p متعارضان

source: duplicate zone name %s (file "%s", line %<PRIdMAX>)
ar: اسم منطقة مكرر %s (الملف "%s"، السطر %<PRIdMAX>)

source: wrong number of fields on Zone continuation line
ar: عدد حقول خاطئ في سطر تكملة المنطقة

source: invalid UT offset
ar: إزاحة UT غير صالحة

source: invalid abbreviation format
ar: تنسيق اختصار غير صالح

source: Zone continuation line end time is not after end time of previous line
ar: وقت نهاية سطر تكملة المنطقة ليس بعد وقت نهاية السطر السابق

source: format '%s' not handled by pre-2015 versions of zic
ar: التنسيق '%s' لا تعالجه إصدارات zic ما قبل 2015

source: invalid leaping year
ar: سنة كبيسة غير صالحة

source: invalid month name
ar: اسم شهر غير صالح

source: invalid day of month
ar: يوم شهر غير صالح

source: time too small
ar: وقت صغير جداً

source: time too large
ar: وقت كبير جداً

source: invalid time of day
ar: وقت اليوم غير صالح

source: leap second precedes Epoch
ar: الثانية الكبيسة تسبق الحقبة

source: wrong number of fields on Leap line
ar: عدد حقول خاطئ في سطر الكبيس (Leap)

source: invalid Rolling/Stationary field on Leap line
ar: حقل Rolling/Stationary غير صالح في سطر Leap

source: invalid CORRECTION field on Leap line
ar: حقل CORRECTION غير صالح في سطر Leap

source: wrong number of fields on Expires line
ar: عدد حقول خاطئ في سطر الانتهاء (Expires)

source: multiple Expires lines
ar: أسطر انتهاء متعددة

source: wrong number of fields on Link line
ar: عدد حقول خاطئ في سطر الرابط (Link)

source: blank TARGET field on Link line
ar: حقل TARGET فارغ في سطر الرابط

source: FROM year "%s" is obsolete; treated as %d
ar: السنة FROM "%s" مهجورة؛ ستعامل كـ %d

source: invalid starting year
ar: سنة بدء غير صالحة

source: invalid ending year
ar: سنة انتهاء غير صالحة

source: starting year greater than ending year
ar: سنة البدء أكبر من سنة الانتهاء

source: year type "%s" is unsupported; use "-" instead
ar: نوع السنة "%s" غير مدعوم؛ استخدم "-" بدلاً منه

source: invalid weekday name
ar: اسم يوم أسبوع غير صالح

source: reference clients mishandle more than %d transition times
ar: عملاء المرجع يسيئون التعامل مع أكثر من %d أوقات تحول

source: pre-2014 clients may mishandle more than 1200 transition times
ar: عملاء ما قبل 2014 قد يسيئون التعامل مع أكثر من 1200 وقت تحول

source: %s: pre-2021b clients may mishandle leap second expiry
ar: %s: عملاء ما قبل 2021b قد يسيئون التعامل مع انتهاء صلاحية الثانية الكبيسة

source: %s: pre-2021b clients may mishandle leap second table truncation
ar: %s: عملاء ما قبل 2021b قد يسيئون التعامل مع بتر جدول الثواني الكبيسة

source: too many transition times
ar: أوقات تحول كثيرة جداً

source: %%z UT offset magnitude exceeds 99:59:59
ar: قيمة إزاحة %%z UT تتجاوز 99:59:59

source: no proleptic TZ string for zone
ar: لا توجد سلسلة TZ استباقية للمنطقة

source: %s: pre-%d clients may mishandle distant timestamps
ar: %s: عملاء ما قبل %d قد يسيئون التعامل مع الطوابع الزمنية البعيدة

source: two rules for same instant
ar: قاعدتان لنفس اللحظة

source: can't determine time zone abbreviation to use just after until time
ar: لا يمكن تحديد اختصار المنطقة الزمنية للاستخدام مباشرة بعد وقت "حتى" (until)

source: UT offset out of range
ar: إزاحة UT خارج النطاق

source: too many local time types
ar: أنواع وقت محلي كثيرة جداً

source: too many leap seconds
ar: ثواني كبيسة كثيرة جداً

source: Rolling leap seconds not supported with -r
ar: الثواني الكبيسة المتناوبة (Rolling) غير مدعومة مع -r

source: Leap seconds too close together
ar: الثواني الكبيسة قريبة جداً من بعضها

source: last Leap time does not precede Expires time
ar: وقت الكبيس الأخير لا يسبق وقت الانتهاء

source: "%s" is undocumented; use "last%s" instead
ar: "%s" غير موثق؛ استخدم "last%s" بدلاً منه

source: "%s" is ambiguous in pre-2017c zic
ar: "%s" غامض في zic ما قبل 2017c

source: Odd number of quotation marks
ar: عدد فردي من علامات الاقتباس

source: Too many input fields
ar: حقول إدخال كثيرة جداً

source: use of 2/29 in non leap-year
ar: استخدام 29/2 في سنة غير كبيسة

source: rule goes past start/end of month; will not work with pre-2004 versions of zic
ar: القاعدة تتجاوز بداية/نهاية الشهر؛ لن تعمل مع إصدارات zic ما قبل 2004

source: time zone abbreviation has fewer than 3 characters
ar: اختصار المنطقة الزمنية يحتوي أقل من 3 محارف

source: time zone abbreviation has too many characters
ar: اختصار المنطقة الزمنية يحتوي محارف كثيرة جداً

source: time zone abbreviation differs from POSIX standard
ar: اختصار المنطقة الزمنية يختلف عن معيار POSIX

source: too many, or too long, time zone abbreviations
ar: اختصارات منطقة زمنية كثيرة جداً أو طويلة جداً

source: %s: Can't create directory %s: %s
ar: %s: لا يمكن إنشاء الدليل %s: %s
