Repository: kraj/glibc
Catalog: po/*.po
Languages: ar

source: Do not create hard links between installed locales
ar: لا تنشئ روابط صلبة بين المحلات المثبتة

source: Optional output file prefix
ar: بادئة ملف مخرجات اختيارية

source: Strictly conform to POSIX
ar: الالتزام الصارم بمعيار POSIX

source: Suppress warnings and information messages
ar: كتم التحذيرات ورسائل المعلومات

source: Print more messages
ar: طباعة المزيد من الرسائل

source: <warnings>
ar: <تحذيرات>

source: Comma-separated list of warnings to disable; supported warnings are: ascii, intcurrsym
ar: قائمة تحذيرات مفصولة بفواصل لتعطيلها؛ التحذيرات المدعومة هي: ascii, intcurrsym

source: Comma-separated list of warnings to enable; supported warnings are: ascii, intcurrsym
ar: قائمة تحذيرات مفصولة بفواصل لتمكينها؛ التحذيرات المدعومة هي: ascii, intcurrsym

source: Archive control:
ar: التحكم في الأرشيف:

source: Don't add new data to archive
ar: لا تضف بيانات جديدة للأرشيف

source: Add locales named by parameters to archive
ar: إضافة المحلات المسماة بالمعاملات إلى الأرشيف

source: Replace existing archive content
ar: استبدال محتوى الأرشيف الموجود

source: Remove locales named by parameters from archive
ar: إزالة المحلات المسماة بالمعاملات من الأرشيف

source: List content of archive
ar: سرد محتوى الأرشيف

source: locale.alias file to consult when making archive
ar: ملف locale.alias للاستشارة عند إنشاء الأرشيف

source: Generate little-endian output
ar: توليد مخرجات بنهاية صغرى (little-endian)

source: Generate big-endian output
ar: توليد مخرجات بنهاية كبرى (big-endian)

source: Compile locale specification
ar: ترجمة مواصفات المحل

source: NAME [--add-to-archive|--delete-from-archive] FILE... --list-archive [FILE]
ar: الاسم [--add-to-archive|--delete-from-archive] ملف... --list-archive [ملف]

source: cannot create directory for output files
ar: لا يمكن إنشاء دليل لملفات المخرجات

source: FATAL: system does not define `_POSIX2_LOCALEDEF'
ar: فادح: النظام لا يعرف `_POSIX2_LOCALEDEF'

source: cannot open locale definition file `%s'
ar: لا يمكن فتح ملف تعريف المحل `%s'

source: cannot write output files to `%s'
ar: لا يمكن كتابة ملفات المخرجات إلى `%s'

source: no output file produced because errors were issued
ar: لم ينتج ملف مخرجات بسبب صدور أخطاء

source: System's directory for character maps : %s repertoire maps: %s locale path : %s %s
ar: دليل النظام لخرائط المحارف : %s خرائط الذخيرة: %s مسار المحل : %s %s

source: cannot create output path '%s': %s
ar: لا يمكن إنشاء مسار المخرجات '%s': %s

source: no write permission to output path '%s': %s
ar: لا يوجد إذن كتابة لمسار المخرجات '%s': %s

source: circular dependencies between locale definitions
ar: تبعيات دائرية بين تعريفات المحلات

source: cannot add already read locale `%s' a second time
ar: لا يمكن إضافة المحل المقروء مسبقاً `%s' مرة ثانية

source: cannot create temporary file: %s
ar: لا يمكن إنشاء ملف مؤقت: %s

source: cannot initialize archive file
ar: لا يمكن تهيئة ملف الأرشيف

source: cannot resize archive file
ar: لا يمكن تغيير حجم ملف الأرشيف

source: cannot map archive header
ar: لا يمكن مسح ترويسة الأرشيف

source: failed to create new locale archive
ar: فشل إنشاء أرشيف محل جديد

source: cannot change mode of new locale archive
ar: لا يمكن تغيير نمط أرشيف المحل الجديد

source: cannot read data from locale archive
ar: لا يمكن قراءة البيانات من أرشيف المحل

source: cannot map locale archive file
ar: لا يمكن مسح ملف أرشيف المحل

source: cannot lock new archive
ar: لا يمكن قفل الأرشيف الجديد

source: cannot extend locale archive file
ar: لا يمكن تمديد ملف أرشيف المحل

source: cannot change mode of resized locale archive
ar: لا يمكن تغيير نمط أرشيف المحل الذي غيّر حجمه

source: cannot rename new archive
ar: لا يمكن إعادة تسمية الأرشيف الجديد

source: cannot open locale archive "%s"
ar: لا يمكن فتح أرشيف المحل "%s"

source: cannot stat locale archive "%s"
ar: لا يمكن فحص (stat) أرشيف المحل "%s"

source: cannot lock locale archive "%s"
ar: لا يمكن قفل أرشيف المحل "%s"

source: cannot unlock archive header
ar: لا يمكن إلغاء قفل ترويسة الأرشيف

source: cannot read archive header
ar: لا يمكن قراءة ترويسة الأرشيف

source: bad magic value in archive header
ar: قيمة سحرية سيئة في ترويسة الأرشيف

source: locale '%s' already exists
ar: المحل '%s' موجود مسبقاً

source: cannot add to locale archive
ar: لا يمكن الإضافة إلى أرشيف المحل

source: locale alias file `%s' not found
ar: ملف اسم مستعار المحل `%s' غير موجود

source: Adding %s
ar: إضافة %s

source: stat of "%s" failed: %s: ignored
ar: فشل فحص (stat) لـ "%s": %s: تم تجاهله

source: "%s" is no directory; ignored
ar: "%s" ليس دليلاً؛ تم تجاهله

source: cannot open directory "%s": %s: ignored
ar: لا يمكن فتح الدليل "%s": %s: تم تجاهله

source: incomplete set of locale files in "%s"
ar: مجموعة غير مكتملة من ملفات المحل في "%s"

source: cannot read all files in "%s": ignored
ar: لا يمكن قراءة جميع الملفات في "%s": تم تجاهله

source: locale "%s" not in archive
ar: المحل "%s" ليس في الأرشيف

source: argument to `%s' must be a single character
ar: يجب أن يكون المعامل لـ `%s' محرفاً واحداً

source: syntax error: not inside a locale definition section
ar: خطأ في بناء الجملة: ليس داخل مقطع تعريف محل

source: cannot open output file `%s' for category `%s'
ar: لا يمكن فتح ملف المخرجات `%s' للفئة `%s'

source: failure while writing data for category `%s'
ar: فشل أثناء كتابة البيانات للفئة `%s'

source: cannot create output file `%s' for category `%s'
ar: لا يمكن إنشاء ملف المخرجات `%s' للفئة `%s'

source: expecting string argument for `copy'
ar: يتوقع معامل سلسلة لـ `copy'

source: locale name should consist only of portable characters
ar: يجب أن يتكون اسم المحل من محارف محمولة فقط

source: no other keyword shall be specified when `copy' is used
ar: يجب عدم تحديد أي كلمة مفتاحية أخرى عند استخدام `copy'

source: `%1$s' definition does not end with `END %1$s'
ar: تعريف `%1$s' لا ينتهي بـ `END %1$s'

source: syntax error in repertoire map definition: %s
ar: خطأ في بناء الجملة في تعريف خارطة الذخيرة: %s

source: no <Uxxxx> or <Uxxxxxxxx> value given
ar: لم تعطَ قيمة <Uxxxx> أو <Uxxxxxxxx>

source: cannot save new repertoire map
ar: لا يمكن حفظ خارطة ذخيرة جديدة

source: repertoire map file `%s' not found
ar: ملف خارطة الذخيرة `%s' غير موجود

source: Set the owner, group and access permission of the slave pseudo terminal corresponding to the master pseudo terminal passed on file descriptor `%d'. This is the helper program for the `grantpt' function. It is not intended to be run directly from the command line.
ar: ضبط المالك والمجموعة وإذن الوصول للطرفية الوهمية التابعة المقابلة للطرفية الوهمية الرئيسية الممرة في واصف الملف `%d'. هذا برنامج مساعد لوظيفة `grantpt'. ليس من المقصود تشغيله مباشرة من سطر الأوامر.

source: The owner is set to the current user, the group is set to `%s', and the access permission is set to `%o'. %s
ar: المالك مضبوط إلى المستخدم الحالي، والمجموعة مضبوطة إلى `%s'، وإذن الوصول مضبوط إلى `%o'. %s

source: too many arguments
ar: معاملات كثيرة جداً

source: needs to be installed setuid `root'
ar: يحتاج إلى التثبيت بـ setuid `root'

source: memory is consistent, library is buggy
ar: الذاكرة متسقة، المكتبة بها علل

source: memory clobbered before allocated block
ar: الذاكرة تضررت قبل الكتلة المخصصة

source: memory clobbered past end of allocated block
ar: الذاكرة تضررت بعد نهاية الكتلة المخصصة

source: block freed twice
ar: تم تحرير الكتلة مرتين

source: bogus mcheck_status, library is buggy
ar: حالة mcheck_status زائفة، المكتبة بها علل

source: %s: option '%s' requires an argument\n
ar: %s: الخيار '%s' يتطلب معامل\n

source: Usage: memusage [OPTION]... PROGRAM [PROGRAMOPTION]... Profile memory usage of PROGRAM. -n,--progname=NAME Name of the program file to profile -p,--png=FILE Generate PNG graphic and store it in FILE -d,--data=FILE Generate binary data file and store it in FILE -u,--unbuffered Don't buffer output -b,--buffer=SIZE Collect SIZE entries before writing them out --no-timer Don't collect additional information through timer -m,--mmap Also trace mmap & friends -?,--help Print this help and exit --usage Give a short usage message -V,--version Print version information and exit The following options only apply when generating graphical output: -t,--time-based Make graph linear in time -T,--total Also draw graph of total memory use --title=STRING Use STRING as title of the graph -x,--x-size=SIZE Make graphic SIZE pixels wide -y,--y-size=SIZE Make graphic SIZE pixels high Mandatory arguments to long options are also mandatory for any corresponding short options.
ar: الاستخدام: memusage [خيار]... البرنامج [خيار-البرنامج]... توليد تشكيلة استخدام الذاكرة للبرنامج. -n,--progname=NAME اسم ملف البرنامج لتوليد تشكيلة له -p,--png=FILE توليد رسم PNG وتخزينه في FILE -d,--data=FILE توليد ملف بيانات ثنائي وتخزينه في FILE -u,--unbuffered لا تضع المخرجات في ذاكرة وسيطة -b,--buffer=SIZE جمع SIZE مدخلات قبل كتابتها --no-timer لا تجمع معلومات إضافية عبر المؤقت -m,--mmap تتبع أيضاً mmap وأخواتها -?,--help طباعة هذه المساعدة والخروج --usage إعطاء رسالة استخدام قصيرة -V,--version طباعة معلومات الإصدار والخروج الخيارات التالية تنطبق فقط عند توليد مخرجات رسومية: -t,--time-based جعل الرسم بيانياً خطياً في الزمن -T,--total رسم بياني أيضاً لإجمالي استخدام الذاكرة --title=STRING استخدام STRING كعنوان للرسم البياني -x,--x-size=SIZE جعل عرض الرسم SIZE بكسل -y,--y-size=SIZE جعل ارتفاع الرسم SIZE بكسل المعاملات الإلزامية للخيارات الطويلة هي إلزامية أيضاً للخيارات القصيرة المقابلة.

source: Syntax: memusage [--data=FILE] [--progname=NAME] [--png=FILE] [--unbuffered] [--buffer=SIZE] [--no-timer] [--time-based] [--total] [--title=STRING] [--x-size=SIZE] [--y-size=SIZE] PROGRAM [PROGRAMOPTION]...
ar: بناء الجملة: memusage [--data=ملف] [--progname=اسم] [--png=ملف] [--unbuffered] [--buffer=حجم] [--no-timer] [--time-based] [--total] [--title=سلسلة] [--x-size=حجم] [--y-size=حجم] البرنامج [خيار-البرنامج]...

source: memusage: option \`${1##*=}' is ambiguous
ar: memusage: الخيار \`${1##*=}' غامض

source: memusage: unrecognized option \`$1'
ar: memusage: خيار غير معروف \`$1'

source: No program name given
ar: لم يعطَ اسم برنامج

source: Name output file
ar: تسمية ملف المخرجات

source: STRING
ar: سلسلة

source: Title string used in output graphic
ar: سلسلة العنوان المستخدمة في الرسم البياني المخرج

source: Generate output linear to time (default is linear to number of function calls)
ar: توليد مخرجات خطية للزمن (المبدئي خطي لعدد استدعاءات الدالة)

source: Also draw graph for total memory consumption
ar: رسم بياني أيضاً لإجمالي استهلاك الذاكرة

source: VALUE
ar: قيمة

source: Make output graphic VALUE pixels wide
ar: جعل عرض الرسم المخرج VALUE بكسل

source: Make output graphic VALUE pixels high
ar: جعل ارتفاع الرسم المخرج VALUE بكسل

source: Generate graphic from memory profiling data
ar: توليد رسم بياني من بيانات تشكيلة الذاكرة

source: DATAFILE [OUTFILE]
ar: ملف-بيانات [ملف-مخرجات]

source: Unknown system error
ar: خطأ نظام مجهول

source: unable to free arguments
ar: غير قادر على تحرير المعاملات

source: Success
ar: نجاح

source: Probable success
ar: نجاح محتمل

source: Not found
ar: لم يُعثر عليه

source: Probably not found
ar: غالباً لم يُعثر عليه

source: Cache expired
ar: انتهت صلاحية الخبيئة

source: NIS+ servers unreachable
ar: لا يمكن الوصول لخوادم NIS+

source: Unknown object
ar: كائن مجهول

source: Server busy, try again
ar: الخادم مشغول، حاول ثانية

source: Generic system error
ar: خطأ نظام عام

source: First/next chain broken
ar: سلسلة الأول/التالي مكسورة

source: Permission denied
ar: الإذن مرفوض

source: Not owner
ar: ليس المالك

source: Name not served by this server
ar: الاسم لا يخدمه هذا الخادم

source: Server out of memory
ar: نفدت ذاكرة الخادم

source: Object with same name exists
ar: يوجد كائن بالاسم ذاته

source: Not master server for this domain
ar: ليس الخادم الرئيسي لهذا النطاق

source: Invalid object for operation
ar: كائن غير صالح للعملية

source: Malformed name, or illegal name
ar: اسم مشوه، أو اسم غير قانوني

source: Unable to create callback
ar: غير قادر على إنشاء استدعاء راجع

source: Results sent to callback proc
ar: أرسلت النتائج إلى إجراء الاستدعاء الراجع

source: Not found, no such name
ar: لم يُعثر عليه، لا يوجد اسم كهذا

source: Name/entry isn't unique
ar: الاسم/المدخل ليس فريداً

source: Modification failed
ar: فشل التعديل

source: Database for table does not exist
ar: قاعدة بيانات الجدول غير موجودة

source: Entry/table type mismatch
ar: عدم تطابق نوع المدخل/الجدول

source: Link points to illegal name
ar: الرابط يشير إلى اسم غير قانوني

source: Partial success
ar: نجاح جزئي

source: Too many attributes
ar: سمات كثيرة جداً

source: Error in RPC subsystem
ar: خطأ في نظام RPC الفرعي

source: Missing or malformed attribute
ar: سمة مفقودة أو مشوهة

source: Named object is not searchable
ar: الكائن المسمى غير قابل للبحث

source: Error while talking to callback proc
ar: خطأ أثناء التحدث مع إجراء الاستدعاء الراجع

source: Non NIS+ namespace encountered
ar: واجه مساحة أسماء ليست NIS+

source: Illegal object type for operation
ar: نوع كائن غير قانوني للعملية

source: Passed object is not the same object on server
ar: الكائن الممر ليس هو الكائن ذاته على الخادم

source: Modify operation failed
ar: فشلت عملية التعديل

source: Query illegal for named table
ar: استعلام غير قانوني للجدول المسمى

source: Attempt to remove a non-empty table
ar: محاولة إزالة جدول غير فارغ

source: Error in accessing NIS+ cold start file. Is NIS+ installed?
ar: خطأ في الوصول إلى ملف البدء البارد لـ NIS+. هل NIS+ مثبت؟

source: Full resync required for directory
ar: مزامنة كاملة مطلوبة للدليل

source: NIS+ operation failed
ar: فشلت عملية NIS+

source: NIS+ service is unavailable or not installed
ar: خدمة NIS+ غير متاحة أو غير مثبتة

source: Yes, 42 is the meaning of life
ar: نعم، 42 هي معنى الحياة

source: Unable to authenticate NIS+ server
ar: غير قادر على إجراء الاستيثاق لخادم NIS+

source: Unable to authenticate NIS+ client
ar: غير قادر على إجراء الاستيثاق لعميل NIS+

source: No file space on server
ar: لا توجد مساحة ملفات على الخادم

source: Unable to create process on server
ar: غير قادر على إنشاء عملية على الخادم

source: Master server busy, full dump rescheduled.
ar: الخادم الرئيسي مشغول، أعيدت جدولة التفريغ الكامل.

source: LOCAL entry for UID %d in directory %s not unique
ar: مدخل LOCAL لـ UID %d في الدليل %s ليس فريداً

source: UNKNOWN
ar: مجهول

source: BOGUS OBJECT
ar: كائن زائف

source: NO OBJECT
ar: لا كائن

source: DIRECTORY
ar: دليل

source: GROUP
ar: مجموعة

source: TABLE
ar: جدول

source: ENTRY
ar: مدخل

source: LINK
ar: رابط

source: PRIVATE
ar: خاص

source: (Unknown object
ar: (كائن مجهول

source: Name : `%s'
ar: الاسم : `%s'

source: Type : %s
ar: النوع : %s

source: Master Server :
ar: الخادم الرئيسي :

source: Replicate :
ar: نسخة مكررة :

source: Name : %s
ar: الاسم : %s

source: Public Key :
ar: المفتاح العام :

source: None.
ar: لا شيء.

source: Diffie-Hellmann (%d bits)
ar: ديفي-هيلمان (%d بت)

source: RSA (%d bits)
ar: آر إس إيه (%d بت)

source: Kerberos.
ar: كيربيروس.

source: Unknown (type = %d, bits = %d)
ar: مجهول (النوع = %d، البتات = %d)

source: Universal addresses (%u)
ar: عناوين عالمية (%u)

source: Time to live :
ar: زمن الحياة :

source: Default Access rights :
ar: حقوق الوصول المبدئية :

source: Type : %s
ar: النوع : %s

source: Access rights:
ar: حقوق الوصول:

source: Group Flags :
ar: أعلام المجموعة :

source: Group Members :
ar: أعضاء المجموعة :

source: Table Type : %s
ar: نوع الجدول : %s

source: Number of Columns : %d
ar: عدد الأعمدة : %d

source: Character Separator : %c
ar: فاصل المحارف : %c

source: Search Path : %s
ar: مسار البحث : %s

source: Columns :
ar: الأعمدة :

source: [%d] Name : %s
ar: [%d] الاسم : %s

source: Attributes :
ar: السمات :

source: Access Rights :
ar: حقوق الوصول :

source: Linked Object Type :
ar: نوع الكائن المرتبط :

source: Linked to : %s
ar: مرتبط بـ : %s

source: Entry data of type %s
ar: بيانات المدخل من النوع %s

source: [%u] - [%u bytes]
ar: [%u] - [%u بايت]

source: Encrypted data
ar: بيانات مشفرة

source: Binary data
ar: بيانات ثنائية

source: Object Name : %s
ar: اسم الكائن : %s

source: Directory : %s
ar: الدليل : %s

source: Owner : %s
ar: المالك : %s

source: Group : %s
ar: المجموعة : %s

source: Access Rights :
ar: حقوق الوصول :

source: Time to Live :
ar: زمن الحياة :

source: Creation Time : %s
ar: وقت الإنشاء : %s

source: Mod. Time : %s
ar: وقت التعديل : %s

source: Object Type :
ar: نوع الكائن :

source: Data Length = %u
ar: طول البيانات = %u

source: Status : %s
ar: الحالة : %s

source: Number of objects : %u
ar: عدد الكائنات : %u

source: Object #%d:
ar: كائن رقم %d:

source: Group entry for "%s.%s" group:
ar: مدخل مجموعة لمجموعة "%s.%s":

source: Explicit members:
ar: أعضاء صريحون:

source: No explicit members
ar: لا يوجد أعضاء صريحون

source: Implicit members:
ar: أعضاء ضمنيون:

source: No implicit members
ar: لا يوجد أعضاء ضمنيون

source: Recursive members:
ar: أعضاء متكررون:

source: No recursive members
ar: لا يوجد أعضاء متكررون

source: Explicit nonmembers:
ar: غير أعضاء صريحون:

source: No explicit nonmembers
ar: لا يوجد غير أعضاء صريحون

source: Implicit nonmembers:
ar: غير أعضاء ضمنيون:

source: No implicit nonmembers
ar: لا يوجد غير أعضاء ضمنيون

source: Recursive nonmembers:
ar: غير أعضاء متكررون:

source: No recursive nonmembers
ar: لا يوجد غير أعضاء متكررون

source: Request arguments bad
ar: معاملات الطلب سيئة

source: RPC failure on NIS operation
ar: فشل RPC في عملية NIS

source: Can't bind to server which serves this domain
ar: لا يمكن الربط بالخادم الذي يخدم هذا النطاق

source: No such map in server's domain
ar: لا توجد خارطة كهذه في نطاق الخادم

source: No such key in map
ar: لا يوجد مفتاح كهذا في الخارطة

source: Internal NIS error
ar: خطأ NIS داخلي

source: Local resource allocation failure
ar: فشل تخصيص الموارد المحلية

source: No more records in map database
ar: لا توجد سجلات أخرى في قاعدة بيانات الخارطة

source: Can't communicate with portmapper
ar: لا يمكن التواصل مع portmapper

source: Can't communicate with ypbind
ar: لا يمكن التواصل مع ypbind

source: Can't communicate with ypserv
ar: لا يمكن التواصل مع ypserv

source: Local domain name not set
ar: اسم النطاق المحلي غير مضبوط

source: NIS map database is bad
ar: قاعدة بيانات خارطة NIS سيئة

source: NIS client/server version mismatch - can't supply service
ar: عدم تطابق إصدار عميل/خادم NIS - لا يمكن تقديم الخدمة

source: Database is busy
ar: قاعدة البيانات مشغولة

source: Unknown NIS error code
ar: رمز خطأ NIS مجهول

source: Internal ypbind error
ar: خطأ ypbind داخلي

source: Domain not bound
ar: النطاق غير مربوط

source: System resource allocation failure
ar: فشل تخصيص موارد النظام

source: Unknown ypbind error
ar: خطأ ypbind مجهول

source: yp_update: cannot convert host to netname
ar: yp_update: لا يمكن تحويل المضيف إلى اسم شبكة

source: yp_update: cannot get server address
ar: yp_update: لا يمكن الحصول على عنوان الخادم

source: Haven't found "%s" in hosts cache!
ar: لم يعثر على "%s" في خبيئة المضيفين!

source: Reloading "%s" in hosts cache!
ar: إعادة تحميل "%s" في خبيئة المضيفين!

source: add new entry "%s" of type %s for %s to cache%s
ar: إضافة مدخل جديد "%s" من نوع %s لـ %s إلى الخبيئة %s

source: (first)
ar: (أولاً)

source: checking for monitored file `%s': %s
ar: فحص الملف المراقب `%s': %s

source: monitored file `%s` changed (mtime)
ar: تغير الملف المراقب `%s` (mtime)

source: pruning %s cache; time %ld
ar: تقليم خبيئة %s؛ الوقت %ld

source: considering %s entry "%s", timeout %<PRIu64>
ar: النظر في مدخل %s "%s"، مهلة %<PRIu64>

source: - all data:
ar: - جميع البيانات:

source: - remaining data %p:
ar: - البيانات المتبقية %p:

source: invalid persistent database file "%s": %s
ar: ملف قاعدة بيانات مستمر غير صالح "%s": %s

source: uninitialized header
ar: ترويسة غير مهيأة

source: header size does not match
ar: حجم الترويسة غير متطابق

source: file size does not match
ar: حجم الملف غير متطابق

source: verification failed
ar: فشل التحقق

source: suggested size of table for database %s larger than the persistent database's table
ar: الحجم المقترح لجدول قاعدة البيانات %s أكبر من جدول قاعدة البيانات المستمرة

source: cannot create read-only descriptor for "%s"; no mmap
ar: لا يمكن إنشاء واصف للقراءة فقط لـ "%s"؛ لا يوجد mmap

source: cannot access '%s'
ar: لا يمكن الوصول لـ '%s'

source: database for %s corrupted or simultaneously used; remove %s manually if necessary and restart
ar: قاعدة بيانات %s تالفة أو مستخدمة في وقت واحد؛ أزل %s يدوياً إذا لزم الأمر وأعد التشغيل

source: cannot create %s; no persistent database used
ar: لا يمكن إنشاء %s؛ لا توجد قاعدة بيانات مستمرة مستخدمة

source: cannot create %s; no sharing possible
ar: يتعذر إنشاء %s؛ المشاركة غير ممكنة

source: cannot write to database file %s: %s
ar: يتعذر الكتابة في ملف قاعدة البيانات %s: %s

source: cannot open socket: %s
ar: يتعذر فتح المقبس: %s

source: cannot enable socket to accept connections: %s
ar: يتعذر تفعيل المقبس لقبول الاتصالات: %s

source: disabled inotify-based monitoring for file `%s': %s
ar: عُطلت المراقبة المعتمدة على inotify للملف `%s': %s

source: monitoring file `%s` (%d)
ar: مراقبة الملف `%s` (%d)

source: disabled inotify-based monitoring for directory `%s': %s
ar: عُطلت المراقبة المعتمدة على inotify للدليل `%s': %s

source: monitoring directory `%s` (%d)
ar: مراقبة الدليل `%s` (%d)

source: monitoring file %s for database %s
ar: مراقبة الملف %s لقاعدة البيانات %s

source: stat failed for file `%s'; will try again later: %s
ar: فشل stat للملف `%s'؛ تجري المحاولة لاحقاً: %s

source: provide access to FD %d, for %s
ar: توفير الوصول إلى FD %d، لـ %s

source: cannot handle old request version %d; current version is %d
ar: يتعذر التعامل مع إصدار الطلب القديم %d؛ الإصدار الحالي هو %d

source: request from %ld not handled due to missing permission
ar: لم يُعالج الطلب من %ld بسبب فقدان التصريح

source: request from '%s' [%ld] not handled due to missing permission
ar: لم يُعالج الطلب من '%s' [%ld] بسبب فقدان التصريح

source: request not handled due to missing permission
ar: لم يُعالج الطلب بسبب فقدان التصريح

source: cannot write result: %s
ar: يتعذر كتابة النتيجة: %s

source: error getting caller's id: %s
ar: خطأ أثناء جلب معرف المستدعَي: %s

source: cannot open /proc/self/cmdline: %m; disabling paranoia mode
ar: يتعذر فتح /proc/self/cmdline: %m؛ يُعطل وضع البارانويا

source: cannot change to old UID: %s; disabling paranoia mode
ar: يتعذر التغيير إلى معرف المستخدم (UID) القديم: %s؛ يُعطل وضع البارانويا

source: cannot change to old GID: %s; disabling paranoia mode
ar: يتعذر التغيير إلى معرف المجموعة (GID) القديم: %s؛ يُعطل وضع البارانويا

source: cannot change to old working directory: %s; disabling paranoia mode
ar: يتعذر التغيير إلى دليل العمل القديم: %s؛ يُعطل وضع البارانويا

source: re-exec failed: %s; disabling paranoia mode
ar: فشل إعادة التنفيذ (re-exec): %s؛ يُعطل وضع البارانويا

source: cannot change current working directory to "/": %s
ar: يتعذر تغيير دليل العمل الحالي إلى "/": %s

source: short read while reading request: %s
ar: قراءة ناقصة أثناء قراءة الطلب: %s

source: key length in request too long: %d
ar: طول المفتاح في الطلب طويل جداً: %d

source: short read while reading request key: %s
ar: قراءة ناقصة أثناء قراءة مفتاح الطلب: %s

source: handle_request: request received (Version = %d) from PID %ld
ar: handle_request: استُقبل طلب (إصدار = %d) من PID %ld

source: handle_request: request received (Version = %d)
ar: handle_request: استُقبل طلب (إصدار = %d)

source: ignored inotify event for `%s` (file exists)
ar: تُجوهل حدث inotify لـ `%s` (الملف موجود)

source: monitored file `%s` was %s, removing watch
ar: الملف المراقب `%s` كان %s، تجري إزالة المراقبة

source: failed to remove file watch `%s`: %s
ar: فشل إزالة مراقبة الملف `%s`: %s

source: monitored file `%s` was written to
ar: الملف المراقب `%s` كُتب فيه

source: monitored parent directory `%s` was %s, removing watch on `%s`
ar: الدليل الأب المراقب `%s` كان %s، تجري إزالة المراقبة على `%s`

source: monitored file `%s` was %s, adding watch
ar: الملف المراقب `%s` كان %s، تجري إضافة مراقبة

source: failed to add file watch `%s`: %s
ar: فشل إضافة مراقبة الملف `%s`: %s
