Repository: kraj/glibc
Catalog: po/*.po
Languages: ar

source: disabled inotify-based monitoring after read error %d
ar: عُطلت المراقبة المعتمدة على inotify بعد خطأ قراءة %d

source: could not initialize conditional variable
ar: يتعذر تهيئة المتغير الشرطي

source: could not start clean-up thread; terminating
ar: يتعذر بدء خيط التنظيف؛ يجري الإنهاء

source: could not start any worker thread; terminating
ar: يتعذر بدء أي خيط عامل؛ يجري الإنهاء

source: Failed to run nscd as user '%s'
ar: فشل تشغيل nscd كالمستخدم '%s'

source: initial getgrouplist failed
ar: فشل getgrouplist الأولي

source: getgrouplist failed
ar: فشل getgrouplist

source: setgroups failed
ar: فشل setgroups

source: short write in %s: %s
ar: كتابة ناقصة في %s: %s

source: Haven't found "%s" in group cache!
ar: لم يُعثر على "%s" في خبيئة المجموعة!

source: Reloading "%s" in group cache!
ar: إعادة تحميل "%s" في خبيئة المجموعة!

source: Invalid numeric gid "%s"!
ar: معرف مجموعة (gid) رقمي غير صالح "%s"!

source: freed %zu bytes in %s cache
ar: حُرّر %zu بايت في خبيئة %s

source: no more memory for database '%s'
ar: لا توجد ذاكرة كافية لقاعدة البيانات '%s'

source: Haven't found "%s" in netgroup cache!
ar: لم يُعثر على "%s" في خبيئة مجموعة الشبكة!

source: Reloading "%s" in netgroup cache!
ar: إعادة تحميل "%s" في خبيئة مجموعة الشبكة!

source: Haven't found "%s (%s,%s,%s)" in netgroup cache!
ar: لم يُعثر على "%s (%s,%s,%s)" في خبيئة مجموعة الشبكة!

source: Reloading "%s (%s,%s,%s)" in netgroup cache!
ar: إعادة تحميل "%s (%s,%s,%s)" في خبيئة مجموعة الشبكة!

source: Read configuration data from NAME
ar: قراءة بيانات الضبط من NAME

source: Do not fork and display messages on the current tty
ar: عدم التفرع وعرض الرسائل على tty الحالي

source: Print contents of the offline cache file NAME
ar: طباعة محتويات ملف الخبيئة غير المتصل NAME

source: Do not fork, but otherwise behave like a daemon
ar: عدم التفرع، والتصرف كخادم خلفي

source: Start NUMBER threads
ar: بدء عدد NUMBER من الخيوط

source: Shut the server down
ar: إيقاف الخادم

source: Print current configuration statistics
ar: طباعة إحصائيات الضبط الحالية

source: Invalidate the specified cache
ar: إبطال الخبيئة المحددة

source: Use separate cache for each user
ar: استخدام خبيئة منفصلة لكل مستخدم

source: Name Service Cache Daemon.
ar: خادم خبيئة خدمة الأسماء.

source: wrong number of arguments
ar: عدد معاملات خاطئ

source: failure while reading configuration file; this is fatal
ar: فشل أثناء قراءة ملف الضبط؛ هذا خطأ فادح

source: already running
ar: يعمل بالفعل

source: cannot create a pipe to talk to the child
ar: يتعذر إنشاء أنبوب للتحدث مع الابن

source: cannot fork
ar: يتعذر التفرع

source: cannot change current working directory to "/"
ar: يتعذر تغيير دليل العمل الحالي إلى "/"

source: Could not create log file
ar: يتعذر إنشاء ملف السجل

source: write incomplete
ar: كتابة غير مكتملة

source: cannot read invalidate ACK
ar: يتعذر قراءة تأكيد الإبطال (ACK)

source: invalidation failed
ar: فشل الإبطال

source: Only root is allowed to use this option!
ar: يُسمح للجذر (root) فقط باستخدام هذا الخيار!

source: '%s' is not a known database
ar: '%s' ليست قاعدة بيانات معروفة

source: secure services not implemented anymore
ar: الخدمات الآمنة لم تعد مدعومة

source: Supported tables: %s For bug reporting instructions, please see: %s.
ar: الجداول المدعومة: %s لتعليمات الإبلاغ عن العيوب، يرجى مراجعة: %s.

source: 'wait' failed
ar: فشل 'wait'

source: child exited with status %d
ar: خرج الابن بالحالة %d

source: child terminated by signal %d
ar: أُنهي الابن بالإشارة %d

source: database %s is not supported
ar: قاعدة البيانات %s غير مدعومة

source: Parse error: %s
ar: خطأ تحليل: %s

source: Must specify user name for server-user option
ar: يجب تحديد اسم المستخدم لخيار server-user

source: Must specify user name for stat-user option
ar: يجب تحديد اسم المستخدم لخيار stat-user

source: Must specify value for restart-interval option
ar: يجب تحديد قيمة لخيار restart-interval

source: Unknown option: %s %s %s
ar: خيار غير معروف: %s %s %s

source: cannot get current working directory: %s; disabling paranoia mode
ar: يتعذر جلب دليل العمل الحالي: %s؛ يُعطل وضع البارانويا

source: maximum file size for %s database too small
ar: أقصى حجم ملف لقاعدة بيانات %s صغير جداً

source: cannot write statistics: %s
ar: يتعذر كتابة الإحصائيات: %s

source: yes
ar: نعم

source: no
ar: لا

source: Only root or %s is allowed to use this option!
ar: يُسمح للجذر (root) أو %s فقط باستخدام هذا الخيار!

source: nscd not running!
ar: nscd لا يعمل!

source: cannot read statistics data
ar: يتعذر قراءة بيانات الإحصائيات

source: nscd configuration: %15d server debug level
ar: ضبط nscd: %15d مستوى تنقيح الخادم

source: %3ud %2uh %2um %2lus server runtime
ar: %3ud %2uh %2um %2lus وقت تشغيل الخادم

source: %2uh %2um %2lus server runtime
ar: %2uh %2um %2lus وقت تشغيل الخادم

source: %2um %2lus server runtime
ar: %2um %2lus وقت تشغيل الخادم

source: %2lus server runtime
ar: %2lus وقت تشغيل الخادم

source: %15d current number of threads %15d maximum number of threads %15lu number of times clients had to wait %15s paranoia mode enabled %15lu restart internal %15u reload count
ar: %15d عدد الخيوط الحالي %15d أقصى عدد خيوط %15lu عدد المرات التي اضطر فيها العملاء للانتظار %15s وضع البارانويا مفعل %15lu الفاصل الزمني لإعادة التشغيل %15u عدد مرات إعادة التحميل

source: %s cache: %15s cache is enabled %15s cache is persistent %15s cache is shared %15zu suggested size %15zu total data pool size %15zu used data pool size %15lu seconds time to live for positive entries %15lu seconds time to live for negative entries %15<PRIuMAX> cache hits on positive entries %15<PRIuMAX> cache hits on negative entries %15<PRIuMAX> cache misses on positive entries %15<PRIuMAX> cache misses on negative entries %15lu%% cache hit rate %15zu current number of cached values %15zu maximum number of cached values %15zu maximum chain length searched %15<PRIuMAX> number of delays on rdlock %15<PRIuMAX> number of delays on wrlock %15<PRIuMAX> memory allocations failed %15s check /etc/%s for changes
ar: خبيئة %s: %15s الخبيئة مفعلة %15s الخبيئة مستمرة %15s الخبيئة مشتركة %15zu الحجم المقترح %15zu إجمالي حجم تجمع البيانات %15zu حجم تجمع البيانات المستخدم %15lu ثواني وقت الحياة للمدخلات الإيجابية %15lu ثواني وقت الحياة للمدخلات السلبية %15<PRIuMAX> إصابات الخبيئة للمدخلات الإيجابية %15<PRIuMAX> إصابات الخبيئة للمدخلات السلبية %15<PRIuMAX> إخفاقات الخبيئة للمدخلات الإيجابية %15<PRIuMAX> إخفاقات الخبيئة للمدخلات السلبية %15lu%% معدل إصابة الخبيئة %15zu العدد الحالي للقيم المخبأة %15zu أقصى عدد للقيم المخبأة %15zu أقصى طول لسلسلة البحث %15<PRIuMAX> عدد التأخيرات في قفل القراءة %15<PRIuMAX> عدد التأخيرات في قفل الكتابة %15<PRIuMAX> فشل تخصيص الذاكرة %15s تحقق من /etc/%s للتغييرات

source: Haven't found "%s" in user database cache!
ar: لم يُعثر على "%s" في خبيئة قاعدة بيانات المستخدمين!

source: Reloading "%s" in user database cache!
ar: إعادة تحميل "%s" في خبيئة قاعدة بيانات المستخدمين!

source: Invalid numeric uid "%s"!
ar: معرف مستخدم (uid) رقمي غير صالح "%s"!

source: Failed opening connection to the audit subsystem: %m
ar: فشل فتح اتصال بنظام المراجعة الفرعي: %m

source: Failed to set keep-capabilities
ar: فشل ضبط keep-capabilities

source: prctl(KEEPCAPS) failed
ar: فشل prctl(KEEPCAPS)

source: Failed to initialize drop of capabilities
ar: فشل تهيئة إسقاط القدرات

source: cap_init failed
ar: فشل cap_init

source: Failed to drop capabilities
ar: فشل إسقاط القدرات

source: cap_set_proc failed
ar: فشل cap_set_proc

source: Failed to unset keep-capabilities
ar: فشل إلغاء ضبط keep-capabilities

source: Failed to determine if kernel supports SELinux
ar: فشل تحديد ما إذا كانت النواة تدعم SELinux

source: Failed to start AVC thread
ar: فشل بدء خيط AVC

source: Failed to create AVC lock
ar: فشل إنشاء قفل AVC

source: Failed to start AVC
ar: فشل بدء AVC

source: Access Vector Cache (AVC) started
ar: بُدئت خبيئة شعاع الوصول (AVC)

source: Error querying policy for undefined object classes or permissions.
ar: خطأ أثناء الاستعلام عن السياسة لأصناف كائنات أو تصاريح غير معرفة.

source: Error getting security class for nscd.
ar: خطأ أثناء جلب صنف الأمان لـ nscd.

source: Error translating permission name "%s" to access vector bit.
ar: خطأ أثناء ترجمة اسم التصريح "%s" إلى بت شعاع الوصول.

source: Error getting context of socket peer
ar: خطأ أثناء جلب سياق نظير المقبس

source: Error getting context of nscd
ar: خطأ أثناء جلب سياق nscd

source: Error getting sid from context
ar: خطأ أثناء جلب sid من السياق

source: SELinux AVC Statistics: %15u entry lookups %15u entry hits %15u entry misses %15u entry discards %15u CAV lookups %15u CAV hits %15u CAV probes %15u CAV misses
ar: إحصائيات SELinux AVC: %15u عمليات بحث عن المدخلات %15u إصابات المدخلات %15u إخفاقات المدخلات %15u المدخلات المهملة %15u عمليات بحث CAV %15u إصابات CAV %15u فحوصات CAV %15u إخفاقات CAV

source: Haven't found "%s" in services cache!
ar: لم يُعثر على "%s" في خبيئة الخدمات!

source: Reloading "%s" in services cache!
ar: إعادة تحميل "%s" في خبيئة الخدمات!

source: database [key ...]
ar: قاعدة البيانات [مفتاح ...]

source: CONFIG
ar: ضبط

source: Service configuration to be used
ar: ضبط الخدمة المراد استخدامه

source: disable IDN encoding
ar: تعطيل ترميز IDN

source: do not filter out unsupported IPv4/IPv6 addresses (with ahosts*)
ar: عدم تصفية عناوين IPv4/IPv6 غير المدعومة (مع ahosts*)

source: Get entries from administrative database.
ar: جلب المدخلات من قاعدة البيانات الإدارية.

source: Enumeration not supported on %s
ar: التعداد غير مدعوم على %s

source: Could not allocate group list: %m
ar: يتعذر تخصيص قائمة المجموعات: %m

source: Unknown database name
ar: اسم قاعدة بيانات غير معروف

source: Supported databases:
ar: قواعد البيانات المدعومة:

source: Unknown database: %s
ar: قاعدة بيانات غير معروفة: %s

source: Convert key to lower case
ar: تحويل المفتاح إلى حالة الأحرف الصغيرة

source: Do not print messages while building database
ar: عدم طباعة رسائل أثناء بناء قاعدة البيانات

source: Print content of database file, one entry a line
ar: طباعة محتوى ملف قاعدة البيانات، مدخل واحد في كل سطر

source: CHAR
ar: محرف

source: Generated line not part of iteration
ar: السطر المولد ليس جزءاً من التكرار

source: Create simple database from textual input.
ar: إنشاء قاعدة بيانات بسيطة من مدخلات نصية.

source: cannot open database file `%s'
ar: يتعذر فتح ملف قاعدة البيانات `%s'

source: no entries to be processed
ar: لا توجد مدخلات للمعالجة

source: cannot create temporary file name
ar: يتعذر إنشاء اسم ملف مؤقت

source: cannot create temporary file
ar: يتعذر إنشاء ملف مؤقت

source: cannot stat newly created file
ar: يتعذر إجراء stat للملف المنشأ حديثاً

source: cannot rename temporary file
ar: يتعذر إعادة تسمية الملف مؤقت

source: cannot create search tree
ar: يتعذر إنشاء شجرة بحث

source: duplicate key
ar: مفتاح مكرر

source: problems while reading `%s'
ar: مشاكل أثناء قراءة `%s'

source: failed to allocate memory
ar: فشل تخصيص الذاكرة

source: failed to write new database file
ar: فشل كتابة ملف قاعدة بيانات جديد

source: cannot stat database file
ar: يتعذر إجراء stat لملف قاعدة البيانات

source: cannot map database file
ar: يتعذر تعيين (map) ملف قاعدة البيانات

source: file not a database file
ar: الملف ليس ملف قاعدة بيانات

source: cannot initialize SELinux context
ar: يتعذر تهيئة سياق SELinux

source: cannot set file creation context for `%s'
ar: يتعذر ضبط سياق إنشاء الملف لـ `%s'

source: Usage: %s [-v specification] variable_name [pathname]
ar: الاستخدام: %s [-v المواصفات] variable_name [pathname]

source: Usage: getconf [-v SPEC] VAR or: getconf [-v SPEC] PATH_VAR PATH Get the configuration value for variable VAR, or for variable PATH_VAR for path PATH. If SPEC is given, give values for compilation environment SPEC.
ar: الاستخدام: getconf [-v SPEC] VAR أو: getconf [-v SPEC] PATH_VAR PATH جلب قيمة الضبط للمتغير VAR، أو للمتغير PATH_VAR للمسار PATH. إذا أُعطيت SPEC، تعطي القيم لبيئة التجميع SPEC.

source: unknown specification "%s"
ar: مواصفة غير معروفة "%s"

source: Couldn't execute %s
ar: تعذر تنفيذ %s

source: undefined
ar: غير محدد

source: Unrecognized variable `%s'
ar: متغير غير معروف `%s'

source: %s: option '%s%s' is ambiguous
ar: %s: الخيار '%s%s' غامض

source: %s: option '%s%s' is ambiguous; possibilities:
ar: %s: الخيار '%s%s' غامض؛ الاحتمالات:

source: %s: unrecognized option '%s%s'
ar: %s: خيار غير معروف '%s%s'

source: %s: option '%s%s' doesn't allow an argument
ar: %s: الخيار '%s%s' لا يسمح بمعامل

source: %s: option '%s%s' requires an argument
ar: %s: الخيار '%s%s' يتطلب معاملاً

source: %s: invalid option -- '%c'
ar: %s: خيار غير صالح -- '%c'

source: %s: option requires an argument -- '%c'
ar: %s: الخيار يتطلب معاملاً -- '%c'

source: No match
ar: لا يوجد تطابق

source: Invalid regular expression
ar: تعبير نمطي غير صالح

source: Invalid collation character
ar: محرف ترتيب (collation) غير صالح

source: Invalid character class name
ar: اسم صنف محرف غير صالح

source: Trailing backslash
ar: شرطة مائلة عكسية في النهاية

source: Invalid back reference
ar: مرجع خلفي غير صالح

source: Unmatched [, [^, [:, [., or [=
ar: [, [^, [:, [., أو [= بلا مقابل

source: Unmatched ( or \(
ar: ( أو \( بلا مقابل

source: Unmatched \{
ar: \{ بلا مقابل

source: Invalid content of \{\}
ar: محتوى غير صالح في \{\}

source: Invalid range end
ar: نهاية نطاق غير صالحة

source: Memory exhausted
ar: نفدت الذاكرة

source: Invalid preceding regular expression
ar: تعبير نمطي سابق غير صالح

source: Premature end of regular expression
ar: نهاية سابقة لأوانها للتعبير النمطي

source: Regular expression too big
ar: التعبير النمطي كبير جداً

source: Unmatched ) or \)
ar: ) أو \) بلا مقابل

source: No previous regular expression
ar: لا يوجد تعبير نمطي سابق

source: parameter null or not set
ar: المعامل فارغ أو غير محدد

source: Resolver Error 0 (no error)
ar: خطأ المحلل (Resolver) رقم 0 (لا يوجد خطأ)

source: Unknown host
ar: حاسوب غير معروف

source: Host name lookup failure
ar: فشل البحث عن اسم الحاسوب

source: Unknown server error
ar: خطأ خادم غير معروف

source: No address associated with name
ar: لا يوجد عنوان مرتبط بالاسم

source: Resolver internal error
ar: خطأ داخلي في المحلل (Resolver)

source: Unknown resolver error
ar: خطأ محلل (Resolver) غير معروف

source: %s: line %d: cannot specify more than %d trim domains
ar: %s: سطر %d: لا يمكن تحديد أكثر من %d نطاقات تهذيب (trim domains)

source: %s: line %d: list delimiter not followed by domain
ar: %s: سطر %d: محدد القائمة لم يتبعه نطاق

source: %s: line %d: expected `on' or `off', found `%s'
ar: %s: سطر %d: توقع 'on' أو 'off'، وُجد `%s'

source: %s: line %d: bad command `%s'
ar: %s: سطر %d: أمر سيئ `%s'

source: %s: line %d: ignoring trailing garbage `%s'
ar: %s: سطر %d: تجاهل المهملات في النهاية `%s'

source: Illegal opcode
ar: رمز عملية (opcode) غير قانوني

source: Illegal operand
ar: معامل (operand) غير قانوني

source: Illegal addressing mode
ar: نمط عنونة غير قانوني

source: Illegal trap
ar: مصيدة (trap) غير قانونية

source: Privileged opcode
ar: رمز عملية (opcode) مميز

source: Privileged register
ar: سجل مميز

source: Coprocessor error
ar: خطأ في المعالج المساعد

source: Internal stack error
ar: خطأ داخلي في المكدس

source: Integer divide by zero
ar: قسمة عدد صحيح على صفر

source: Integer overflow
ar: تجاوز سعة العدد الصحيح

source: Floating-point divide by zero
ar: قسمة الفاصلة العائمة على صفر

source: Floating-point overflow
ar: تجاوز سعة الفاصلة العائمة

source: Floating-point underflow
ar: انخفاض سعة الفاصلة العائمة

source: Floating-poing inexact result
ar: نتيجة غير دقيقة للفاصلة العائمة

source: Invalid floating-point operation
ar: عملية فاصلة عائمة غير صالحة

source: Subscript out of range
ar: المنخفض خارج النطاق

source: Address not mapped to object
ar: العنوان غير معين لكائن

source: Invalid permissions for mapped object
ar: تصاريح غير صالحة للكائن المعين

source: Invalid address alignment
ar: محاذاة عنوان غير صالحة

source: Nonexisting physical address
ar: عنوان فيزيائي غير موجود

source: Object-specific hardware error
ar: خطأ في العتاد خاص بالكائن

source: Process breakpoint
ar: نقطة توقف العملية

source: Process trace trap
ar: مصيدة تتبع العملية

source: Child has exited
ar: خرج الابن

source: Child has terminated abnormally and did not create a core file
ar: أُنهي الابن بشكل غير طبيعي ولم ينشئ ملف لب (core file)

source: Child has terminated abnormally and created a core file
ar: أُنهي الابن بشكل غير طبيعي وأنشأ ملف لب (core file)

source: Traced child has trapped
ar: الابن المتتبع وقع في المصيدة

source: Child has stopped
ar: توقف الابن

source: Stopped child has continued
ar: استمر الابن المتوقف

source: Data input available
ar: مدخلات البيانات متاحة

source: Output buffers available
ar: خبيئات المخرجات متاحة

source: Input message available
ar: رسالة المدخلات متاحة

source: I/O error
ar: خطأ إدخال/إخراج

source: High priority input available
ar: مدخلات عالية الأولوية متاحة

source: Device disconnected
ar: انقطع اتصال الجهاز

source: Signal sent by kill()
ar: إشارة مرسلة بواسطة kill()

source: Signal sent by sigqueue()
ar: إشارة مرسلة بواسطة sigqueue()

source: Signal generated by the expiration of a timer
ar: إشارة ناتجة عن انتهاء صلاحية المؤقت

source: Signal generated by the completion of an asynchronous I/O request
ar: إشارة ناتجة عن اكتمال طلب إدخال/إخراج غير متزامن

source: Signal generated by the arrival of a message on an empty message queue
ar: إشارة ناتجة عن وصول رسالة إلى طابور رسائل فارغ

source: Signal sent by tkill()
ar: إشارة مرسلة بواسطة tkill()

source: Signal generated by the completion of an asynchronous name lookup request
ar: إشارة ناتجة عن اكتمال طلب بحث عن اسم غير متزامن

source: Signal generated by the completion of an I/O request
ar: إشارة ناتجة عن اكتمال طلب إدخال/إخراج

source: Signal sent by the kernel
ar: إشارة مرسلة من النواة

source: Unknown signal %d
ar: إشارة غير معروفة %d

source: %s%sUnknown signal %d
ar: %s%sإشارة غير معروفة %d

source: Unknown signal
ar: إشارة غير معروفة

source: Unknown error
ar: خطأ غير معروف

source: Real-time signal %d
ar: إشارة وقت حقيقي %d

source: Unknown signal %d
ar: إشارة غير معروفة %d

source: out of memory
ar: نفدت الذاكرة

source: auth_unix.c: Fatal marshalling problem
ar: auth_unix.c: مشكلة ترتيب (marshalling) فادحة

source: %s: %s; low version = %lu, high version = %lu
ar: %s: %s؛ الإصدار الأدنى = %lu، الإصدار الأعلى = %lu

source: %s: %s; why = %s
ar: %s: %s؛ السبب = %s

source: %s: %s; why = (unknown authentication error - %d)
ar: %s: %s؛ السبب = (خطأ استيثاق غير معروف - %d)

source: RPC: Success
ar: RPC: نجاح

source: RPC: Can't encode arguments
ar: RPC: يتعذر ترميز المعاملات

source: RPC: Can't decode result
ar: RPC: يتعذر فك ترميز النتيجة

source: RPC: Unable to send
ar: RPC: غير قادر على الإرسال

source: RPC: Unable to receive
ar: RPC: غير قادر على الاستقبال

source: RPC: Timed out
ar: RPC: انتهت المهلة

source: RPC: Incompatible versions of RPC
ar: RPC: إصدارات RPC غير متوافقة

source: RPC: Authentication error
ar: RPC: خطأ استيثاق

source: RPC: Program unavailable
ar: RPC: البرنامج غير متاح

source: RPC: Program/version mismatch
ar: RPC: عدم تطابق البرنامج/الإصدار

source: RPC: Procedure unavailable
ar: RPC: الإجراء غير متاح

source: RPC: Server can't decode arguments
ar: RPC: الخادم لا يمكنه فك ترميز المعاملات

source: RPC: Remote system error
ar: RPC: خطأ في النظام البعيد

source: RPC: Unknown host
ar: RPC: حاسوب غير معروف

source: RPC: Unknown protocol
ar: RPC: بروتوكول غير معروف

source: RPC: Port mapper failure
ar: RPC: فشل مخطط المنافذ

source: RPC: Program not registered
ar: RPC: البرنامج غير مسجل

source: RPC: Failed (unspecified error)
ar: RPC: فشل (خطأ غير محدد)

source: RPC: (unknown error code)
ar: RPC: (رمز خطأ غير معروف)

source: Authentication OK
ar: الاستيثاق مقبول

source: Invalid client credential
ar: أوراق اعتماد العميل غير صالحة

source: Server rejected credential
ar: رفض الخادم أوراق الاعتماد

source: Invalid client verifier
ar: متحقق العميل غير صالح

source: Server rejected verifier
ar: رفض الخادم المتحقق

source: Client credential too weak
ar: أوراق اعتماد العميل ضعيفة جداً

source: Invalid server verifier
ar: متحقق الخادم غير صالح

source: Failed (unspecified error)
ar: فشل (خطأ غير محدد)

source: clnt_raw.c: fatal header serialization error
ar: clnt_raw.c: خطأ تسلسل ترويسة فادح

source: pmap_getmaps.c: rpc problem
ar: pmap_getmaps.c: مشكلة rpc

source: Cannot register service
ar: يتعذر تسجيل الخدمة

source: Cannot create socket for broadcast rpc
ar: يتعذر إنشاء مقبس لـ broadcast rpc

source: Cannot set socket option SO_BROADCAST
ar: يتعذر ضبط خيار المقبس SO_BROADCAST

source: Cannot send broadcast packet
ar: يتعذر إرسال حزمة البث

source: Broadcast poll problem
ar: مشكلة استطلاع البث

source: Cannot receive reply to broadcast
ar: يتعذر استقبال رد على البث

source: svc_run: - out of memory
ar: svc_run: - نفدت الذاكرة

source: svc_run: - poll failed
ar: svc_run: - فشل الاستطلاع (poll)

source: can't reassign procedure number %ld
ar: يتعذر إعادة تعيين رقم الإجراء %ld

source: couldn't create an rpc server
ar: تعذر إنشاء خادم rpc

source: couldn't register prog %ld vers %ld
ar: تعذر تسجيل البرنامج %ld إصدار %ld

source: registerrpc: out of memory
ar: registerrpc: نفدت الذاكرة

source: trouble replying to prog %d
ar: مشكلة في الرد على البرنامج %d

source: never registered prog %d
ar: لم يُسجل البرنامج %d أبداً

source: svc_tcp.c - tcp socket creation problem
ar: svc_tcp.c - مشكلة في إنشاء مقبس tcp

source: svc_tcp.c - cannot getsockname or listen
ar: svc_tcp.c - يتعذر getsockname أو listen

source: svcudp_create: socket creation problem
ar: svcudp_create: مشكلة في إنشاء المقبس

source: svcudp_create - cannot getsockname
ar: svcudp_create - يتعذر getsockname

source: svcudp_create: xp_pad is too small for IP_PKTINFO
ar: svcudp_create: xp_pad صغير جداً لـ IP_PKTINFO

source: enablecache: cache already enabled
ar: enablecache: الخبيئة مفعلة بالفعل

source: enablecache: could not allocate cache
ar: enablecache: تعذر تخصيص خبيئة

source: enablecache: could not allocate cache data
ar: enablecache: تعذر تخصيص بيانات الخبيئة

source: enablecache: could not allocate cache fifo
ar: enablecache: تعذر تخصيص fifo للخبيئة

source: cache_set: victim not found
ar: cache_set: لم يُعثر على الضحية

source: cache_set: victim alloc failed
ar: cache_set: فشل تخصيص الضحية

source: cache_set: could not allocate new rpc_buffer
ar: cache_set: تعذر تخصيص rpc_buffer جديد

source: svc_unix.c - AF_UNIX socket creation problem
ar: svc_unix.c - مشكلة في إنشاء مقبس AF_UNIX

source: svc_unix.c - cannot getsockname or listen
ar: svc_unix.c - يتعذر getsockname أو listen

source: error due to GNU_PROPERTY_1_NEEDED_INDIRECT_EXTERN_ACCESS
ar: خطأ بسبب GNU_PROPERTY_1_NEEDED_INDIRECT_EXTERN_ACCESS

source: Hangup
ar: تعليق

source: Interrupt
ar: مقاطعة

source: Quit
ar: إنهاء

source: Illegal instruction
ar: تعليمة غير قانونية

source: Trace/breakpoint trap
ar: مصيدة تتبع/نقطة توقف

source: Aborted
ar: أُجهض

source: Floating point exception
ar: استثناء فاصلة عائمة

source: Killed
ar: قُتل

source: Bus error
ar: خطأ ناقل

source: Bad system call
ar: نداء نظام سيئ

source: Segmentation fault
ar: خطأ في التقسيم

source: Broken pipe
ar: أنبوب مكسور

source: Alarm clock
ar: ساعة منبه

source: Terminated
ar: أُنهي

source: Urgent I/O condition
ar: حالة إدخال/إخراج عاجلة

source: Stopped (signal)
ar: توقف (إشارة)

source: Stopped
ar: توقف

source: Continued
ar: استمر

source: Child exited
ar: خرج الابن

source: Stopped (tty input)
ar: توقف (مدخلات tty)

source: Stopped (tty output)
ar: توقف (مخرجات tty)

source: I/O possible
ar: إدخال/إخراج ممكن

source: CPU time limit exceeded
ar: تجاوز حد وقت المعالج

source: File size limit exceeded
ar: تجاوز حد حجم الملف

source: Virtual timer expired
ar: انتهى المؤقت الافتراضي

source: Profiling timer expired
ar: انتهى مؤقت التحليل (Profiling)

source: User defined signal 1
ar: إشارة معرفة من المستخدم 1

source: User defined signal 2
ar: إشارة معرفة من المستخدم 2

source: Window changed
ar: تغيرت النافذة

source: EMT trap
ar: مصيدة EMT

source: Stack fault
ar: خطأ في المكدس

source: Power failure
ar: فشل الطاقة
