Repository: kraj/glibc
Catalog: po/*.po
Languages: ar

source: error while reading the input
ar: خطأ أثناء قراءة المدخلات

source: unable to allocate buffer for input
ar: غير قادر على تخصيص مخزن مؤقت للمدخلات

source: Input/Output format specification:
ar: مواصفات تنسيق المدخلات/المخرجات:

source: encoding of original text
ar: ترميز النص الأصلي

source: encoding for output
ar: ترميز المخرجات

source: Information:
ar: المعلومات:

source: list all known coded character sets
ar: أدرج كافة مجموعات المحارف المرمزة المعروفة

source: Output control:
ar: التحكم في المخرجات:

source: omit invalid characters from output
ar: حذف المحارف غير الصالحة من المخرجات

source: FILE
ar: ملف

source: output file
ar: ملف المخرجات

source: suppress warnings
ar: كتم التحذيرات

source: print progress information
ar: اطبع معلومات التقدم

source: size of in-memory scratch buffer
ar: حجم مخزن المسودة المؤقت في الذاكرة

source: Convert encoding of given files from one encoding to another.
ar: تحويل ترميز الملفات المعطاة من ترميز إلى آخر.

source: [FILE...]
ar: [ملف...]

source: failed to start conversion processing
ar: فشل في بدء معالجة التحويل

source: conversions from `%s' and to `%s' are not supported
ar: التحويلات من `%s' وإلى `%s' غير مدعومة

source: conversion from `%s' is not supported
ar: التحويل من `%s' غير مدعوم

source: conversion to `%s' is not supported
ar: التحويل إلى `%s' غير مدعوم

source: conversion from `%s' to `%s' is not supported
ar: التحويل من `%s' إلى `%s' غير مدعوم

source: invalid buffer size: %s
ar: حجم مخزن مؤقت غير صالح: %s

source: conversion stopped due to problem in writing the output
ar: توقف التحويل بسبب مشكلة في كتابة المخرجات

source: illegal input sequence at position %lld
ar: تسلسل مدخلات غير قانوني في الموقع %lld

source: internal error (illegal descriptor)
ar: خطأ داخلي (واصف غير قانوني)

source: unknown iconv() error %d
ar: خطأ iconv() غير معروف %d

source: The following list contains all the coded character sets known. This does not necessarily mean that all combinations of these names can be used for the FROM and TO command line parameters. One coded character set can be listed with several different names (aliases).
ar: القائمة التالية تحتوي على جميع مجموعات المحارف المرمزة المعروفة. هذا لا يعني بالضرورة إمكانية استخدام جميع تركيبات هذه الأسماء لمعاملات سطر الأوامر FROM و TO. يمكن إدراج مجموعة محارف مرمزة واحدة بعدة أسماء مختلفة (أسماء مستعارة).

source: Create fastloading iconv module configuration file.
ar: إنشاء ملف ضبط لوحدة iconv سريع التحميل.

source: [DIR...]
ar: [الدليل…]

source: PATH
ar: المسار

source: Prefix used for all file accesses
ar: البادئة المستخدمة لكافة عمليات الوصول للملفات

source: Put output in FILE instead of installed location (--prefix does not apply to FILE)
ar: ضع المخرجات في FILE بدلاً من موقع التثبيت (--prefix لا ينطبق على FILE)

source: Do not search standard directories, only those on the command line
ar: لا تبحث في الأدلة القياسية، فقط تلك المحددة في سطر الأوامر

source: Directory arguments required when using --nostdlib
ar: وسائط الدليل مطلوبة عند استخدام --nostdlib

source: no output file produced because warnings were issued
ar: لم يتم إنتاج ملف مخرجات بسبب صدور تحذيرات

source: while inserting in search tree
ar: أثناء الإدراج في شجرة البحث

source: cannot generate output file
ar: يتعذر توليد ملف المخرجات

source: write of %zu bytes failed after %td: %m
ar: فشلت كتابة %zu بايت بعد %td: %m

source: write returned 0 after writing %td bytes of %zu
ar: أرجعت الكتابة 0 بعد كتابة %td بايت من %zu

source: read of %zu bytes failed after %td: %m
ar: فشلت قراءة %zu بايت بعد %td: %m

source: rcmd: Cannot allocate memory
ar: rcmd: يتعذر تخصيص الذاكرة

source: rcmd: socket: All ports in use
ar: rcmd: socket: جميع المنافذ قيد الاستخدام

source: connect to address %s:
ar: اتصل بالعنوان %s:

source: Trying %s...
ar: محاولة %s...

source: rcmd: write (setting up stderr): %m
ar: rcmd: كتابة (إعداد stderr): %m

source: rcmd: poll (setting up stderr): %m
ar: rcmd: استطلاع poll (إعداد stderr): %m

source: poll: protocol failure in circuit setup
ar: poll: فشل في البروتوكول في إعداد الدائرة

source: socket: protocol failure in circuit setup
ar: socket: فشل في البروتوكول في إعداد الدائرة

source: rcmd: %s: short read
ar: rcmd: %s: قراءة قصيرة

source: lstat failed
ar: فشل lstat

source: cannot open
ar: يتعذر فتح

source: fstat failed
ar: فشل fstat

source: bad owner
ar: مالك سيئ

source: writeable by other than owner
ar: قابل للكتابة من قبل غير المالك

source: hard linked somewhere
ar: مربوط ربطاً صلباً في مكان ما

source: out of memory
ar: نفدت الذاكرة

source: Error: .netrc file is readable by others.
ar: خطأ: ملف .netrc قابل للقراءة من قبل الآخرين.

source: Remove 'password' line or make file unreadable by others.
ar: أزل سطر 'password' أو اجعل الملف غير قابل للقراءة من قبل الآخرين.

source: Unknown .netrc keyword %s
ar: كلمة مفتاحية غير معروفة في .netrc: %s

source: cannot read character map directory `%s'
ar: يتعذر قراءة دليل خريطة المحارف `%s'

source: character map file `%s' not found
ar: ملف خريطة المحارف `%s' غير موجود

source: default character map file `%s' not found
ar: ملف خريطة المحارف المبدئي `%s' غير موجود

source: character map `%s' is not ASCII compatible, locale not ISO C compliant [--no-warnings=ascii]
ar: خريطة المحارف `%s' غير متوافقة مع ASCII، المحلية غير متوافقة مع ISO C [--no-warnings=ascii]

source: %s: <mb_cur_max> must be greater than <mb_cur_min>
ar: %s: يجب أن يكون <mb_cur_max> أكبر من <mb_cur_min>

source: syntax error in prolog: %s
ar: خطأ نحوي في المقدمة: %s

source: invalid definition
ar: تعريف غير صالح

source: bad argument
ar: وسيط سيئ

source: duplicate definition of <%s>
ar: تعريف مكرر لـ <%s>

source: value for <%s> must be 1 or greater
ar: قيمة <%s> يجب أن تكون 1 أو أكبر

source: value of <%s> must be greater or equal than the value of <%s>
ar: قيمة <%s> يجب أن تكون أكبر من أو تساوي قيمة <%s>

source: argument to <%s> must be a single character
ar: الوسيط لـ <%s> يجب أن يكون محرفاً واحداً

source: character sets with locking states are not supported
ar: مجموعات المحارف ذات حالات القفل غير مدعومة

source: syntax error in %s definition: %s
ar: خطأ نحوي في تعريف %s: %s

source: no symbolic name given
ar: لم يتم إعطاء اسم رمزي

source: invalid encoding given
ar: تم إعطاء ترميز غير صالح

source: too few bytes in character encoding
ar: بايتات قليلة جداً في ترميز المحرف

source: too many bytes in character encoding
ar: بايتات كثيرة جداً في ترميز المحرف

source: no symbolic name given for end of range
ar: لم يتم إعطاء اسم رمزي لنهاية النطاق

source: %1$s: definition does not end with `END %1$s'
ar: %1$s: التعريف لا ينتهي بـ `END %1$s'

source: only WIDTH definitions are allowed to follow the CHARMAP definition
ar: فقط تعريفات WIDTH مسموح بها بعد تعريف CHARMAP

source: value for %s must be an integer
ar: قيمة %s يجب أن تكون عدداً صحيحاً

source: %s: error in state machine
ar: %s: خطأ في آلة الحالة

source: %s: premature end of file
ar: %s: نهاية ملف سابقة لأوانها

source: unknown character `%s'
ar: محرف غير معروف `%s'

source: number of bytes for byte sequence of beginning and end of range not the same: %d vs %d
ar: عدد البايتات لتسلسل البايتات في بداية ونهاية النطاق ليس نفسه: %d مقابل %d

source: invalid names for character range
ar: أسماء غير صالحة لنطاق المحارف

source: hexadecimal range format should use only capital characters
ar: تنسيق النطاق الست عشري يجب أن يستخدم المحارف الكبيرة فقط

source: <%s> and <%s> are invalid names for range
ar: <%s> و <%s> أسماء غير صالحة للنطاق

source: upper limit in range is smaller than lower limit
ar: الحد العلوي في النطاق أصغر من الحد السفلي

source: resulting bytes for range not representable.
ar: البايتات الناتجة للنطاق غير قابلة للتمثيل.

source: No definition for %s category found
ar: لم يتم العثور على تعريف للفئة %s

source: %s: field `%s' not defined
ar: %s: الحقل `%s' غير معرف

source: %s: field `%s' must not be empty
ar: %s: الحقل `%s' يجب ألا يكون فارغاً

source: %s: invalid escape `%%%c' sequence in field `%s'
ar: %s: تسلسل هروب `%%%c' غير صالح في الحقل `%s'

source: %s: terminology language code `%s' not defined
ar: %s: كود لغة المصطلحات `%s' غير معرف

source: %s: field `%s' must not be defined
ar: %s: الحقل `%s' يجب ألا يكون معرفاً

source: %s: language abbreviation `%s' not defined
ar: %s: اختصار اللغة `%s' غير معرف

source: %s: `%s' value does not match `%s' value
ar: %s: قيمة `%s' لا تطابق قيمة `%s'

source: %s: numeric country code `%d' not valid
ar: %s: كود الدولة الرقمي `%d' غير صالح

source: %s: field `%s' declared more than once
ar: %s: الحقل `%s' تم التصريح عنه أكثر من مرة

source: %s: unknown character in field `%s'
ar: %s: محرف غير معروف في الحقل `%s'

source: %s: incomplete `END' line
ar: %s: سطر `END' غير مكتمل

source: %s: syntax error
ar: %s: خطأ نحوي

source: `%.*s' already defined in charmap
ar: `%.*s' معرف مسبقاً في خريطة المحارف

source: `%.*s' already defined in repertoire
ar: `%.*s' معرف مسبقاً في الدليل (repertoire)

source: `%.*s' already defined as collating symbol
ar: `%.*s' معرف مسبقاً كرمز تجميع

source: `%.*s' already defined as collating element
ar: `%.*s' معرف مسبقاً كعنصر تجميع

source: %s: `forward' and `backward' are mutually excluding each other
ar: %s: `forward' و `backward' يستبعد كل منهما الآخر

source: %s: `%s' mentioned more than once in definition of weight %d
ar: %s: `%s' ذكر أكثر من مرة في تعريف الوزن %d

source: %s: too many rules; first entry only had %d
ar: %s: قواعد كثيرة جداً؛ المدخل الأول كان يحتوي فقط على %d

source: %s: not enough sorting rules
ar: %s: لا توجد قواعد فرز كافية

source: %s: empty weight string not allowed
ar: %s: سلسلة وزن فارغة غير مسموح بها

source: %s: weights must use the same ellipsis symbol as the name
ar: %s: يجب أن تستخدم الأوزان نفس رمز الحذف المستخدم في الاسم

source: %s: too many values
ar: %s: قيم كثيرة جداً

source: order for `%.*s' already defined at %s:%zu
ar: ترتيب `%.*s' معرف مسبقاً في %s:%zu

source: %s: the start and the end symbol of a range must stand for characters
ar: %s: يجب أن يمثل رمزا بداية ونهاية النطاق محارف

source: %s: byte sequences of first and last character must have the same length
ar: %s: يجب أن يكون لـ تسلسلات البايت للمحرف الأول والأخير الطول ذاته

source: %s: byte sequence of first character of range is not lower than that of the last character
ar: %s: تسلسل بايت المحرف الأول في النطاق ليس أقل من تسلسل المحرف الأخير

source: %s: symbolic range ellipsis must not directly follow `order_start'
ar: %s: يجب ألا يتبع حذف النطاق الرمزي `order_start' مباشرة

source: %s: symbolic range ellipsis must not be directly followed by `order_end'
ar: %s: يجب ألا يتبع حذف النطاق الرمزي بـ `order_end' مباشرة

source: `%s' and `%.*s' are not valid names for symbolic range
ar: `%s' و `%.*s' ليسا اسمين صالحين لنطاق رمزي

source: %s: order for `%.*s' already defined at %s:%zu
ar: %s: ترتيب `%.*s' معرف مسبقاً في %s:%zu

source: %s: `%s' must be a character
ar: %s: `%s' يجب أن يكون محرفاً

source: %s: `position' must be used for a specific level in all sections or none
ar: %s: يجب استخدام `position' لمستوى محدد في جميع المقاطع أو لا شيء منها

source: symbol `%s' not defined
ar: الرمز `%s' غير معرف

source: symbol `%s' has the same encoding as
ar: الرمز `%s' له نفس ترميز

source: symbol `%s'
ar: الرمز `%s'

source: too many errors; giving up
ar: أخطاء كثيرة جداً؛ توقف العمل

source: %s: nested conditionals not supported
ar: %s: الشرطيات المتداخلة غير مدعومة

source: %s: more than one 'else'
ar: %s: أكثر من 'else' واحدة

source: %s: duplicate definition of `%s'
ar: %s: تعريف مكرر لـ `%s'

source: %s: duplicate declaration of section `%s'
ar: %s: تصريح مكرر للمقطع `%s'

source: %s: unknown character in collating symbol name
ar: %s: محرف مجهول في اسم رمز الترتيب

source: %s: unknown character in equivalent definition name
ar: %s: محرف مجهول في اسم تعريف المكافئ

source: %s: unknown character in equivalent definition value
ar: %s: محرف مجهول في قيمة تعريف المكافئ

source: %s: unknown symbol `%s' in equivalent definition
ar: %s: رمز مجهول `%s' في تعريف المكافئ

source: error while adding equivalent collating symbol
ar: خطأ أثناء إضافة رمز ترتيب مكافئ

source: duplicate definition of script `%s'
ar: تعريف مكرر للبرنامج النصي `%s'

source: %s: unknown section name `%.*s'
ar: %s: اسم مقطع مجهول `%.*s'

source: %s: multiple order definitions for section `%s'
ar: %s: تعريفات ترتيب متعددة للمقطع `%s'

source: %s: invalid number of sorting rules
ar: %s: عدد غير صالح لقواعد الفرز

source: %s: multiple order definitions for unnamed section
ar: %s: تعريفات ترتيب متعددة لمقطع غير مسمى

source: %s: missing `order_end' keyword
ar: %s: كلمة `order_end' المفتاحية مفقودة

source: %s: order for collating symbol %.*s not yet defined
ar: %s: ترتيب رمز الترتيب %.*s غير معرف بعد

source: %s: order for collating element %.*s not yet defined
ar: %s: ترتيب عنصر الترتيب %.*s غير معرف بعد

source: %s: cannot reorder after %.*s: symbol not known
ar: %s: لا يمكن إعادة الترتيب بعد %.*s: الرمز غير معروف

source: %s: missing `reorder-end' keyword
ar: %s: كلمة `reorder-end' المفتاحية مفقودة

source: %s: section `%.*s' not known
ar: %s: المقطع `%.*s' غير معروف

source: %s: bad symbol <%.*s>
ar: %s: رمز سيء <%.*s>

source: %s: cannot have `%s' as end of ellipsis range
ar: %s: لا يمكن لـ `%s' أن يكون نهاية لنطاق الحذف

source: %s: empty category description not allowed
ar: %s: وصف الفئة الفارغ غير مسموح به

source: %s: missing `reorder-sections-end' keyword
ar: %s: كلمة `reorder-sections-end' المفتاحية مفقودة

source: %s: '%s' without matching 'ifdef' or 'ifndef'
ar: %s: '%s' بدون 'ifdef' أو 'ifndef' مطابقة

source: %s: 'endif' without matching 'ifdef' or 'ifndef'
ar: %s: 'endif' بدون 'ifdef' أو 'ifndef' مطابقة

source: No character set name specified in charmap
ar: لا يوجد اسم لمجموعة المحارف محدد في خارطة المحارف

source: character L'\u%0*x' in class `%s' must be in class `%s'
ar: المحرف L'\u%0*x' في الفئة `%s' يجب أن يكون في الفئة `%s'

source: character L'\u%0*x' in class `%s' must not be in class `%s'
ar: المحرف L'\u%0*x' في الفئة `%s' يجب ألا يكون في الفئة `%s'

source: internal error in %s, line %u
ar: خطأ داخلي في %s، سطر %u

source: character '%s' in class `%s' must be in class `%s'
ar: المحرف '%s' في الفئة `%s' يجب أن يكون في الفئة `%s'

source: character '%s' in class `%s' must not be in class `%s'
ar: المحرف '%s' في الفئة `%s' يجب ألا يكون في الفئة `%s'

source: <SP> character not in class `%s'
ar: محرف <SP> ليس في الفئة `%s'

source: <SP> character must not be in class `%s'
ar: يجب ألا يكون محرف <SP> في الفئة `%s'

source: character <SP> not defined in character map
ar: المحرف <SP> غير معرف في خارطة المحارف

source: `digit' category has not entries in groups of ten
ar: فئة `digit' ليس لها مدخلات في مجموعات من عشرة

source: no input digits defined and none of the standard names in the charmap
ar: لا توجد أرقام مدخلة معرفة ولا أي من الأسماء القياسية في خارطة المحارف

source: not all characters used in `outdigit' are available in the charmap
ar: ليست كل المحارف المستخدمة في `outdigit' متاحة في خارطة المحارف

source: not all characters used in `outdigit' are available in the repertoire
ar: ليست كل المحارف المستخدمة في `outdigit' متاحة في الذخيرة

source: character class `%s' already defined
ar: فئة المحارف `%s' معرفة مسبقاً

source: implementation limit: no more than %Zd character classes allowed
ar: حد التنفيذ: لا يسمح بأكثر من %Zd من فئات المحارف

source: character map `%s' already defined
ar: خارطة المحارف `%s' معرفة مسبقاً

source: implementation limit: no more than %d character maps allowed
ar: حد التنفيذ: لا يسمح بأكثر من %d من خرائط المحارف

source: %s: field `%s' does not contain exactly ten entries
ar: %s: الحقل `%s' لا يحتوي على عشرة مدخلات بالضبط

source: to-value <U%0*X> of range is smaller than from-value <U%0*X>
ar: قيمة-إلى <U%0*X> للنطاق أصغر من قيمة-من <U%0*X>

source: start and end character sequence of range must have the same length
ar: يجب أن يكون لـ تسلسل محرف البداية والنهاية للنطاق الطول ذاته

source: to-value character sequence is smaller than from-value sequence
ar: تسلسل محرف قيمة-إلى أصغر من تسلسل قيمة-من

source: premature end of `translit_ignore' definition
ar: نهاية سابقة لأوانها لتعريف `translit_ignore'

source: syntax error
ar: خطأ في بناء الجملة

source: %s: syntax error in definition of new character class
ar: %s: خطأ في بناء الجملة في تعريف فئة محارف جديدة

source: %s: syntax error in definition of new character map
ar: %s: خطأ في بناء الجملة في تعريف خارطة محارف جديدة

source: ellipsis range must be marked by two operands of same type
ar: يجب وسم نطاق الحذف بمعاملين من النوع ذاته

source: with symbolic name range values the absolute ellipsis `...' must not be used
ar: مع قيم نطاق الأسماء الرمزية يجب ألا يستخدم الحذف المطلق `...'

source: with UCS range values one must use the hexadecimal symbolic ellipsis `..'
ar: مع قيم نطاق UCS يجب استخدام الحذف الرمزي الست عشري `..'

source: with character code range values one must use the absolute ellipsis `...'
ar: مع قيم نطاق رموز المحارف يجب استخدام الحذف المطلق `...'

source: duplicated definition for mapping `%s'
ar: تعريف مكرر للمسح `%s'

source: %s: `translit_start' section does not end with `translit_end'
ar: %s: مقطع `translit_start' لا ينتهي بـ `translit_end'

source: %s: duplicate `default_missing' definition
ar: %s: تعريف `default_missing' مكرر

source: previous definition was here
ar: كان التعريف السابق هنا

source: %s: no representable `default_missing' definition found
ar: %s: لم يعثر على تعريف `default_missing' يمكن تمثيله

source: %s: character `%s' not defined while needed as default value
ar: %s: المحرف `%s' غير معرف بينما هو مطلوب كقيمة مبدئية

source: %s: character `%s' in charmap not representable with one byte
ar: %s: المحرف `%s' في خارطة المحارف لا يمكن تمثيله ببايت واحد

source: %s: character `%s' needed as default value not representable with one byte
ar: %s: المحرف `%s' المطلوب كقيمة مبدئية لا يمكن تمثيله ببايت واحد

source: no output digits defined and none of the standard names in the charmap
ar: لا توجد أرقام مخرجة معرفة ولا أي من الأسماء القياسية في خارطة المحارف

source: %s: transliteration data from locale `%s' not available
ar: %s: بيانات النقحرة من المحل `%s' غير متاحة

source: %s: table for class "%s": %lu bytes
ar: %s: جدول للفئة "%s": %lu بايت

source: %s: table for map "%s": %lu bytes
ar: %s: جدول للخارطة "%s": %lu بايت

source: %s: table for width: %lu bytes
ar: %s: جدول للعرض: %lu بايت

source: %s: no identification for category `%s'
ar: %s: لا يوجد تعريف للفئة `%s'

source: %s: unknown standard `%s' for category `%s'
ar: %s: معيار مجهول `%s' للفئة `%s'

source: %s: duplicate category version definition
ar: %s: تعريف مكرر لإصدار الفئة

source: %s: invalid value for field `%s'
ar: %s: قيمة غير صالحة للحقل `%s'

source: %s: field `%s' undefined
ar: %s: الحقل `%s' غير معرف

source: %s: value for field `%s' must not be an empty string
ar: %s: يجب ألا تكون قيمة الحقل `%s' سلسلة فارغة

source: %s: no correct regular expression for field `%s': %s
ar: %s: لا يوجد تعبير نمطي صحيح للحقل `%s': %s

source: %s: value of field `int_curr_symbol' has wrong length
ar: %s: قيمة الحقل `int_curr_symbol' لها طول خاطئ

source: %s: value of field `int_curr_symbol' does not correspond to a valid name in ISO 4217 [--no-warnings=intcurrsym]
ar: %s: قيمة الحقل `int_curr_symbol' لا تقابل اسماً صالحاً في ISO 4217 [--no-warnings=intcurrsym]

source: %s: field `%s' not defined, using defaults
ar: %s: الحقل `%s' غير معرف، يتم استخدام القيم المبدئية

source: %s: value for field `%s' must be in range %d...%d
ar: %s: قيمة الحقل `%s' يجب أن تكون في النطاق %d...%d

source: %s: value for field `%s' must be a single character
ar: %s: قيمة الحقل `%s' يجب أن تكون محرفاً واحداً

source: %s: `-1' must be last entry in `%s' field
ar: %s: `-1' يجب أن يكون آخر مدخل في الحقل `%s'

source: %s: values for field `%s' must be smaller than 127
ar: %s: يجب أن تكون قيم الحقل `%s' أصغر من 127

source: conversion rate value cannot be zero
ar: لا يمكن لقيمة معدل التحويل أن تكون صفراً

source: %s: invalid escape sequence in field `%s'
ar: %s: تسلسل هروب غير صالح في الحقل `%s'

source: %s: direction flag in string %Zd in `era' field is not '+' nor '-'
ar: %s: علم الاتجاه في السلسلة %Zd في حقل `era' ليس '+' ولا '-'

source: %s: direction flag in string %Zd in `era' field is not a single character
ar: %s: علم الاتجاه في السلسلة %Zd في حقل `era' ليس محرفاً واحداً

source: %s: invalid number for offset in string %Zd in `era' field
ar: %s: عدد غير صالح للإزاحة في السلسلة %Zd في حقل `era'

source: %s: garbage at end of offset value in string %Zd in `era' field
ar: %s: نفايات في نهاية قيمة الإزاحة في السلسلة %Zd في حقل `era'

source: %s: invalid starting date in string %Zd in `era' field
ar: %s: تاريخ بدء غير صالح في السلسلة %Zd في حقل `era'

source: %s: garbage at end of starting date in string %Zd in `era' field
ar: %s: نفايات في نهاية تاريخ البدء في السلسلة %Zd في حقل `era'

source: %s: starting date is invalid in string %Zd in `era' field
ar: %s: تاريخ البدء غير صالح في السلسلة %Zd في حقل `era'

source: %s: invalid stopping date in string %Zd in `era' field
ar: %s: تاريخ توقف غير صالح في السلسلة %Zd في حقل `era'

source: %s: garbage at end of stopping date in string %Zd in `era' field
ar: %s: نفايات في نهاية تاريخ التوقف في السلسلة %Zd في حقل `era'

source: %s: missing era name in string %Zd in `era' field
ar: %s: اسم العصر مفقود في السلسلة %Zd في حقل `era'

source: %s: missing era format in string %Zd in `era' field
ar: %s: تنسيق العصر مفقود في السلسلة %Zd في حقل `era'

source: %s: third operand for value of field `%s' must not be larger than %d
ar: %s: المعامل الثالث لقيمة الحقل `%s' يجب ألا يكون أكبر من %d

source: %s: values for field `%s' must not be larger than %d
ar: %s: يجب ألا تكون قيم الحقل `%s' أكبر من %d

source: %s: too few values for field `%s'
ar: %s: قيم قليلة جداً للحقل `%s'

source: extra trailing semicolon
ar: فاصلة منقوطة تالية زائدة

source: %s: too many values for field `%s'
ar: %s: قيم كثيرة جداً للحقل `%s'

source: trailing garbage at end of line
ar: نفايات تالية في نهاية السطر

source: garbage at end of number
ar: نفايات في نهاية الرقم

source: garbage at end of character code specification
ar: نفايات في نهاية تحديد رمز المحرف

source: unterminated symbolic name
ar: اسم رمزي غير منتهٍ

source: invalid UTF-8 sequence %s
ar: تسلسل UTF-8 غير صالح %s

source: illegal 8-bit character in untranslated string
ar: محرف 8-بت غير قانوني في سلسلة غير مترجمة

source: illegal escape sequence at end of string
ar: تسلسل هروب غير قانوني في نهاية السلسلة

source: unterminated string
ar: سلسلة غير منتهية

source: illegal 8-bit escape sequence
ar: تسلسل هروب 8-بت غير قانوني

source: symbol `%.*s' not in charmap
ar: الرمز `%.*s' ليس في خارطة المحارف

source: symbol `%.*s' not in repertoire map
ar: الرمز `%.*s' ليس في خارطة الذخيرة

source: unknown name "%s"
ar: اسم مجهول "%s"

source: System information:
ar: معلومات النظام:

source: Write names of available locales
ar: كتابة أسماء المحلات المتاحة

source: Write names of available charmaps
ar: كتابة أسماء خرائط المحارف المتاحة

source: Modify output format:
ar: تعديل تنسيق المخرجات:

source: Write names of selected categories
ar: كتابة أسماء الفئات المختارة

source: Write names of selected keywords
ar: كتابة أسماء الكلمات المفتاحية المختارة

source: Print more information
ar: طباعة المزيد من المعلومات

source: Get locale-specific information.
ar: الحصول على معلومات خاصة بالمحل.

source: NAME [-a|-m]
ar: الاسم [-a|-m]

source: while preparing output
ar: أثناء تحضير المخرجات

source: Cannot set %s to default locale
ar: لا يمكن ضبط %s إلى المحل المبدئي

source: warning: The LOCPATH variable is set to "%s"
ar: تحذير: متغير LOCPATH مضبوط إلى "%s"

source: Input Files:
ar: ملفات المدخلات:

source: Symbolic character names defined in FILE
ar: أسماء المحارف الرمزية المعرفة في FILE

source: Source definitions are found in FILE
ar: تعريفات المصدر موجودة في FILE

source: FILE contains mapping from symbolic names to UCS4 values
ar: يحتوي FILE على مسح من الأسماء الرمزية إلى قيم UCS4

source: Create output even if warning messages were issued
ar: إنشاء المخرجات حتى لو صدرت رسائل تحذير
